{"profile":"MPhys Physics graduate (First expected) pursuing a Manufacturing Engineer role at Terex in Ballymoney. Practical experience in BOM documentation, material procurement and process improvement, with strong data-analysis (MATLAB/Python), production launch support and clear stakeholder communication.","education":[{"degree":"MPhys Physics","institution":"University of Warwick","location":"UK","start_date":"October 2022","end_date":"July 2026","grade":"First (expected)","description":["Relevant modules: scientific and high-performance computing, advanced mathematical methods, fluid mechanics, control and materials — strong numerical and programming foundation for process design.","Developed a PID stabilisation algorithm in LabVIEW for a nodding-donor rig; tested and tuned control parameters to improve stability (86% project mark).","Implemented finite-difference PDE solvers in C to model heat flow through industrial pipes (95%) and ran 10,000+ simulations for orbital stability using Python.","Led two 6-person research projects on photovoltaic materials; chaired weekly meetings, delegated tasks and delivered results on schedule (70%+)."]},{"degree":"A-levels","institution":"Forest School","location":"UK","start_date":"September 2020","end_date":"July 2022","grade":"A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)","description":["Awarded sixth form valedictorian for academic performance.","Extended Project (5,000 words) on mitigation of climate change through renewables, nuclear and geoengineering — marked 100%.","Presented research to a cohort of 160+ students and staff, demonstrating clear verbal communication and presentation skills."]}],"work_experience":[{"title":"Undergraduate Researcher","company":"Warwick Mathematics Institute","location":"Coventry, UK","start_date":"June 2025","end_date":"October 2025","description":["Modelled finite-difference methods across 100+ aeroacoustics simulations, validating numerical stability and improving solver robustness.","Analysed and compared 10 high-order schemes in MATLAB, optimising trade-offs between accuracy and computational cost — applying data-driven decision-making for process selection.","Prepared and presented a research poster for a departmental event, communicating technical findings to academic stakeholders."]},{"title":"Project Manager","company":"Warwick Aerospace Society","location":"Coventry, UK","start_date":"January 2024","end_date":"March 2025","description":["Managed a 12-person team to design and build a proof-of-concept UHF satellite ground station, coordinating design, procurement and assembly across sub-teams.","Authored 30+ pages of technical documentation including a detailed bill of materials (BOM); oversaw material procurement and supplier liaison to meet a 10-week delivery target.","Established meeting cadence and weekly reports for senior leadership, applying planning, standard work and cross-functional collaboration to keep the project on schedule.","Implemented GitHub version control and MATLAB/Simulink modelling workflows to standardise design data and support reproducible handovers."]},{"title":"RF Seekers Summer Intern","company":"MBDA UK","location":"Stevenage, UK","start_date":"June 2024","end_date":"August 2024","description":["Worked on SAR imagery processing chains within AESA radar systems; optimised a matched-filter algorithm using FFT techniques, reducing runtime by 85% and improving throughput.","Co-developed a data-analysis application used by six colleagues for rapid range–Doppler image review, integrating a mid-fidelity check to accelerate decision-making during campaigns.","Contributed 50+ commits and presented placement outcomes to 20+ technical colleagues, demonstrating clear written and verbal communication and professional software practices."]}],"projects":[{"title":"AI CV Generator","start_date":"July 2025","end_date":"ongoing","description":["Developed a Python application using OpenAI API and Pydantic to produce structured CV and cover-letter outputs, emphasising data integrity and reproducible templates.","Built two SQL databases to track applications and outcomes; used results to iterate the generator and improve ATS compatibility.","Achieved >50% scores on three ATS-checker sites and supported successful applications leading to job offers, demonstrating understanding of ATS keywords and formatting."]},{"title":"Drinks Ordering Web App","start_date":"August 2018","end_date":"September 2018","description":["Designed and delivered a web app to process 80+ orders at a 100+ guest event, removing queuing and reducing service delays.","Implemented asynchronous Ajax updates for real-time order status, improving throughput and user satisfaction.","Coordinated with bar staff to iterate the workflow, demonstrating hands-on process design and rapid on-site problem solving."]}],"skills":{"languages":["Python","MATLAB","C","Simulink","SQL","JSON"],"libraries":["NumPy","SciPy","Matplotlib","pydantic"],"tools":["Microsoft Office (Excel, PowerPoint)","Git / GitHub","LabVIEW","Origin Pro"],"soft_skills":["Clear verbal and written communication and presentation","Planning and organisation","Teamwork and cross-functional collaboration","Working under pressure and accountability","Problem-solving and results orientation"],"interests":["Process improvement (Lean principles, standard work)","Manufacturing systems and material flow","Amateur radio"]}}