{"profile":"Aspiring Algorithmic Trader with strong Python and quantitative analysis from an MPhys. Built and optimised algorithms, performed large-scale simulations and data analysis; eager to learn HFT, liquidity provision and crypto/DeFi. Available for onsite work in London; owner mentality and results-focused.","education":[{"degree":"MPhys Physics","institution":"University of Warwick","location":"UK","start_date":"October 2022","end_date":"July 2026","grade":"First (expected)","description":["Relevant modules: scientific and high-performance computing, advanced mathematical methods, fluid mechanics, quantum mechanics and statistical physics.","Investigated metastability of nucleation in the 2D Ising model via dozens of Monte Carlo simulations in MATLAB; co-authored a paper with two peers.","Ran over 10,000 N-body simulations using a Python integrator and implemented MEGNO analysis for orbital stability with advanced post-processing.","Numerically solved partial differential equations in C using finite-difference methods to model industrial heat flow; assessed accuracy and computational cost."]},{"degree":"A-levels","institution":"Forest School","location":"UK","start_date":"September 2020","end_date":"July 2022","grade":"A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)","description":["Sixth-form valedictorian award for best academic performance.","Produced a 5,000-word extended project on renewable energy, nuclear power and geoengineering; awarded 100%.","Presented research to a cohort of 160+ students and staff; received strong positive feedback."]}],"work_experience":[{"title":"Undergraduate Researcher","company":"Warwick Mathematics Institute","location":"Coventry, UK","start_date":"June 2025","end_date":"October 2025","description":["Modelled finite-difference methods for wave propagation across 100+ aeroacoustics simulations, focusing on accuracy and computational efficiency.","Analysed performance of 10 maximal-order and dispersion-relation-preserving schemes in MATLAB, optimising trade-offs between error and runtime.","Prepared and presented a research poster summarising methods and results to academic peers."]},{"title":"Project Manager","company":"Warwick Aerospace Society","location":"Coventry, UK","start_date":"January 2024","end_date":"March 2025","description":["Managed a 12-member student team developing an ultra-high frequency satellite ground-station proof of concept; owned delivery and schedule.","Authored 30+ pages of technical documentation and a bill of materials; coordinated procurement and assembly to deliver hardware in 10 weeks.","Established GitHub-based version control and initiated MATLAB/Simulink modelling, improving collaboration and reproducibility across sub-teams."]},{"title":"Academic Coordinator","company":"Warwick Physics Society","location":"Coventry, UK","start_date":"March 2024","end_date":"March 2025","description":["Delivered seven revision lectures and ran weekly academic support sessions, improving peers' exam preparation.","Organised a 10-year anniversary talk hosted by Prof Dame Athene Donald, attended by 100+ students and academics.","Explained complex concepts to large groups and adapted material to varied audiences, receiving excellent feedback."]},{"title":"RF Seekers Summer Intern","company":"MBDA UK","location":"Stevenage, UK","start_date":"June 2024","end_date":"August 2024","description":["Interned in the Modelling and Algorithms team; optimised a matched-filter algorithm in MATLAB using FFT, reducing runtime by 85% and improving system throughput.","Co-developed a data-analysis application to enable six colleagues to rapidly inspect range–Doppler imagery, integrating a mid-fidelity algorithm for quick sanity checks.","Delivered 50+ commits using professional version control practices and became a key contributor to the modelling codebase.","Surveyed 10+ research papers to inform algorithmic choices and validate implementations."]}],"projects":[{"title":"AI CV Generator","start_date":"July 2025","end_date":"ongoing","description":["Developed a CV and cover-letter generator using OpenAI's API in Python; designed structured JSON output with Pydantic BaseModel and produced Word documents via docxtpl.","Built two SQL databases to store job applications and track outcomes; implemented repeatable scripting and automated document generation.","Achieved scores above 50% on three ATS-checker websites and correlated use with two job offers from ~200 applications.","Owned the end-to-end project: design, implementation, testing and iterative improvements; used Git for version control."]}],"skills":{"languages":["Python","MATLAB","C","SQL","JavaScript","HTML","CSS"],"libraries":["NumPy","SciPy","Matplotlib","pydantic","jinja","openAI"],"tools":["Git","GitHub","Simulink","LabVIEW","Origin Pro"],"soft_skills":["Analytical thinking","Problem solving","Owner mentality","Teamwork","Adaptability"],"interests":["Machine learning","Amateur radio","Tennis","Football","Chess","Debating"]}}