{"job_title":"Algorithmic Trader","company_name":"Wintermute","industry":"Crypto / Algorithmic Trading / Digital Assets","location":"Central London (onsite at least ~75%), UK (relocation and UK work permits supported)","essential_requirements":["1-3 years experience in a relevant role OR recent graduate with HFT internship experience","Strong Python skills (1-3 years coding experience; will be tested)","Excellent quantitative and analytical skills (assessment/test expected)","Strong willingness and curiosity to learn algorithmic, high-frequency and liquidity provision trading","Strong interest in blockchain, crypto and DeFi and keeping up with industry news","Owner mentality: focus on company P&L and long-term strategic growth","Problem-solving orientation; willingness to trade, code, analyse and collaborate as needed","Determined, ambitious, humble, and able to learn quickly","Comfortable with a meritocratic environment and being judged by deliverables","Entrepreneurial mindset; prepared to work non-standard hours (24/7 crypto market)","Onsite teamwork preference: at least ~75% presence in the London office"],"preferred_requirements":["Previous internships or experience at other HFT / algorithmic trading firms","Prior exposure to building or deploying trading strategies or trading systems","Experience with crypto trading, DeFi projects, or blockchain integrations","Demonstrable project or product ownership (e.g., end-to-end feature/strategy delivery)","Experience analysing large trading/transaction datasets and translating insights into production changes"],"hard_skills":["Python (production coding, scripting, libraries such as NumPy/Pandas expected)","Quantitative analysis and data-driven decision making","Trading algorithm/strategy development and testing (backtesting/data analysis)","Working with large trading and transaction datasets","Basic knowledge of trading systems, market microstructure and liquidity provision concepts","Ability to implement solutions that impact P&L"],"soft_skills":["Owner mentality / strong sense of responsibility","Problem solving and pragmatic execution","Curiosity and appetite to learn (crypto, HFT, DeFi)","Determination, ambition coupled with humility","Team player in a collaborative, non-hierarchical environment","Adaptability to non-standard hours and fast-paced startup culture","Comfort with meritocratic feedback and performance-based evaluation"],"ATS_keywords":["Algorithmic Trader","algo trading","HFT","high-frequency trading","liquidity provision","trading algorithms","trading strategies","Python","quantitative","data analysis","backtesting","P&L","crypto","blockchain","DeFi","OTC","trading systems","London","relocation","work permit","startup","owner mentality","meritocracy"],"key_responsibilities":["Own a trading desk: develop, deploy and iterate on trading algorithms and strategies with direct impact on P&L","Analyze large trading and transaction datasets to generate insights, prioritise opportunities and build/implement solutions","Improve existing strategies and trading infrastructure and add new trading products while collaborating with experienced traders and developers"],"tools_and_technologies":["Python (Pandas, NumPy and common data/ML libraries)","Algorithmic trading platforms / order management systems (exchange APIs)","Crypto exchanges and trading venues / OTC trading platforms","Blockchain / DeFi tooling and explorers","Data analysis and backtesting frameworks","Standard development tools: Git, Linux, CI/CD (typical modern dev stack)"],"company_values":["Entrepreneurial and innovative","Meritocratic — judged by delivery and results","Collaborative and team-oriented","Informal, non-hierarchical and ambitious","High-performance and professional with startup energy","Ownership and responsibility for outcomes"],"tailoring_recommendations":["Lead with Python experience: list projects, libraries used (Pandas/NumPy), and link to code or repos if possible.","Quantify impact: include any P&L, performance improvements, latency reductions, or metrics from trading or data projects.","Highlight relevant internships or roles at HFT/prop trading firms and any hands-on algo trading work.","Show crypto/DeFi interest or work (projects, research, contributions, trading experience) and familiarity with exchanges/APIs.","Demonstrate ownership: examples of end-to-end projects you shipped, decisions you owned, and results delivered.","Prepare for technical assessments: note that Python and quantitative tests are part of the process.","Emphasise fit for a fast, meritocratic startup: willingness to work non-standard hours and be onsite in London (~75%).","Include teamwork examples and ability to collaborate with developers and senior traders; keep CV concise and results-focused."]}