{"profile":"MPhys Physics (expected First, July 2026). Aspiring Graduate Electrical Engineer with hands-on circuit design, MATLAB/Simulink modelling and LabVIEW PID control experience, plus data capture and analysis. Willing to be on-site 4–5 days per week and to undergo Baseline Personnel Security Standard and higher security vetting.","education":[{"degree":"MPhys Physics","institution":"University of Warwick","location":"UK","start_date":"October 2022","end_date":"July 2026","grade":"First (expected)","description":["Relevant modules: electromagnetism, control systems, scientific & high-performance computing, and advanced mathematical methods.","Designed, built and tested a DC voltage regulator circuit using op-amps and MOSFETs; performed bench tests and iterative design adjustments.","Co-developed a LabVIEW stabilisation algorithm implementing PID control for a nodding-donkey system; recorded performance metrics and tuned control parameters.","Performed large-scale numerical simulations (MATLAB/Python) including 10,000+ runs for orbital-stability studies, applying automated post-processing and data analysis techniques."]},{"degree":"A-levels","institution":"Forest School","location":"UK","start_date":"September 2020","end_date":"July 2022","grade":"A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)","description":["Received sixth-form valedictorian award for best academic performance.","Extended Project (5000 words) on energy technologies and climate mitigation, awarded 100%; developed technical writing and literature review skills.","Presented project findings to 160+ students and staff, demonstrating clear verbal communication of technical material."]}],"work_experience":[{"title":"Undergraduate Researcher","company":"Warwick Mathematics Institute","location":"Coventry, UK","start_date":"June 2025","end_date":"October 2025","description":["Modelled finite-difference schemes for wave propagation across 100+ aeroacoustics simulations using MATLAB; compared accuracy and computational cost.","Analysed numerical dispersion and stability for ten high-order schemes, producing quantitative performance comparisons to guide method selection.","Prepared and presented a technical poster summarising methodology and results to academic peers, demonstrating technical reporting and data-visualisation skills."]},{"title":"Project Manager","company":"Warwick Aerospace Society","location":"Coventry, UK","start_date":"January 2024","end_date":"March 2025","description":["Led a 12-member team to develop an ultra-high-frequency ground station prototype, coordinating multidisciplinary sub-teams and schedules.","Authored 30+ pages of design documentation, bills of materials and test plans to support prototype build and verification.","Implemented MATLAB/Simulink models for rotator control and half-duplex communication, and established GitHub version control for model development.","Coordinated procurement, assembly and system integration in a 10-week build cycle, supporting hands-on testing and fault diagnosis."]},{"title":"Academic Coordinator","company":"Warwick Physics Society","location":"Coventry, UK","start_date":"March 2024","end_date":"March 2025","description":["Delivered seven technical revision lectures and led weekly support sessions, translating complex concepts into accessible teaching.","Organised a departmental event attended by 100+ students and faculty, managing logistics and technical briefings.","Provided regular feedback and written summaries to students and staff, demonstrating clear written communication and documentation skills."]},{"title":"RF Seekers Summer Intern","company":"MBDA UK","location":"Stevenage, UK","start_date":"June 2024","end_date":"August 2024","description":["Worked on SAR imagery processing in AESA radar systems; optimised a matched-filter implementation using FFT techniques, reducing runtime by 85%.","Co-developed a MATLAB data-analysis application to support a performance campaign, enabling rapid post-processing and sanity checks against higher-fidelity models.","Adopted professional software practices and version control (50+ commits); presented technical findings to 20+ colleagues, developing concise technical reports and slides."]}],"projects":[{"title":"AI CV Generator","start_date":"July 2025","end_date":"ongoing","description":["Developed a Python application using OpenAI API to generate CVs and cover letters tailored to job descriptions, emphasising structured outputs for ATS compatibility.","Used Pydantic for structured JSON output and docxtpl for automated Word document generation; implemented SQL databases to track applications and outcomes.","Measured ATS performance (scored >50% on multiple checkers) and iteratively improved parsing and keyword matching; supported evidence-based evaluation of CV wording."]},{"title":"Drinks Ordering Web App","start_date":"August 2018","end_date":"September 2018","description":["Built a web application (AJAX) to manage orders at an event of 100+ guests, processing 80+ orders and eliminating queues through asynchronous updates.","Implemented front-end and back-end integration to capture user inputs, update order status and log transactions in a lightweight database.","Received positive usability feedback from event staff and two software engineers, demonstrating rapid prototyping and end-user testing."]}],"skills":{"languages":["Python","MATLAB","Simulink","C","SQL","JavaScript","HTML/CSS"],"libraries":["NumPy","SciPy","Matplotlib","pydantic"],"tools":["LabVIEW","Git / GitHub","Microsoft Office","Origin Pro","docxtpl"],"soft_skills":["Analytical thinking and problem-solving","Technical report writing and presentations","Collaborative multidisciplinary teamwork","Attention to detail and methodical testing","Adaptability and proactive initiative"],"interests":["Power engineering (motors, batteries, variable speed drives) — interest and academic exposure","Embedded systems and firmware basics","Defence, maritime and naval systems (UK MOD standards — keen to learn)"]}}