{"profile":"Physics graduate (MPhys) seeking Junior Field Service Support role at OTT HydroMet. Practical experience in instrument assembly, commissioning and data processing (Python, MATLAB), with strong troubleshooting, technical reporting and customer-facing communication. Willing to travel for site installations and support senior field technicians.","education":[{"degree":"MPhys Physics","institution":"University of Warwick","location":"UK","start_date":"October 2022","end_date":"July 2026","grade":"First (expected)","description":["Relevant modules: scientific and high-performance computing, fluid mechanics, electromagnetism and statistical physics — providing foundations for hydrometry and meteorological instrumentation.","Designed, built and tested a DC voltage regulator circuit using op-amps and MOSFETs; performed bench testing and validation of outputs.","Co-developed a PID stabilisation algorithm in LabVIEW for a nodding-donkey system; implemented control and test procedures and validated improved stability.","Ran large-scale numerical simulations (10,000+ runs and 100+ aeroacoustics cases) in MATLAB/C, developing data-processing pipelines and visualisations for analysis."]},{"degree":"A-levels","institution":"Forest School","location":"UK","start_date":"September 2020","end_date":"July 2022","grade":"A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)","description":["Extended Project: 5000-word research project on renewable energy, nuclear power and geoengineering; achieved 100%, demonstrating technical research and report-writing skills.","Delivered a formal presentation of project findings to a 160+ audience, evidencing clear spoken communication for technical topics.","Awarded sixth form valedictorian for academic performance and rigour."]}],"work_experience":[{"title":"Undergraduate Researcher","company":"Warwick Mathematics Institute","location":"Coventry, UK","start_date":"June 2025","end_date":"October 2025","description":["Modelled finite-difference methods for wave propagation across 100+ aeroacoustics simulations in MATLAB and C, focusing on numerical stability and accuracy.","Analysed and compared dispersion-preserving schemes to diagnose numerical faults and optimise solver configurations for improved performance.","Prepared and presented concise technical poster and supporting documentation summarising methods, results and implications for further commissioning and testing."]},{"title":"Project Manager","company":"Warwick Aerospace Society","location":"Coventry, UK","start_date":"January 2024","end_date":"March 2025","description":["Led a 12-member team to design, procure, assemble and test a proof-of-concept UHF ground station, coordinating scheduling and workstreams to meet a 10-week deadline.","Authored detailed technical documentation (30+ pages), bills of materials and test procedures to support assembly, commissioning and handover.","Organised weekly meetings, delegated tasks and liaised with stakeholders to resolve technical issues and ensure quality control during build and test phases."]},{"title":"RF Seekers Summer Intern","company":"MBDA UK","location":"Stevenage, UK","start_date":"June 2024","end_date":"August 2024","description":["Worked on SAR imagery processing within AESA radar systems; optimised a matched-filter algorithm in MATLAB using FFT, reducing runtime by 85% and improving diagnostic throughput.","Co-developed a data-analysis application to streamline post-processing and troubleshooting of range–Doppler images for six colleagues.","Maintained version control (Git), contributed 50+ commits and presented technical findings to project stakeholders, demonstrating clear technical reporting."]},{"title":"Academic Coordinator","company":"Warwick Physics Society","location":"Coventry, UK","start_date":"March 2024","end_date":"March 2025","description":["Delivered seven technical revision lectures and weekly support sessions, explaining complex concepts clearly to groups of up to 100 students.","Organised departmental events and coordinated speakers, demonstrating stakeholder liaison and event planning skills applicable to customer-facing work.","Prepared learning materials and guides, ensuring clarity, accuracy and accessibility for diverse audiences."]},{"title":"Workshop / Systems Workshop Participant (Fly Your Satellite Workshop)","company":"European Space Agency","location":"Noordwijk, Netherlands","start_date":"November 2024","end_date":"November 2024","description":["Completed a five-day systems-engineering and satellite-development workshop covering requirements, ground-station comms and rapid prototyping under time pressure.","Collaborated in a team to design a CubeSat mission sprint, applying systems-level thinking to integration, testing and mission constraints.","Gained practical insight into ground-station hardware, communications workflows and testing procedures relevant to field commissioning and diagnostics."]}],"projects":[{"title":"AI CV Generator","start_date":"July 2025","end_date":"ongoing","description":["Developed a Python application using OpenAI's API and Pydantic to generate tailored CVs and cover letters, automating structured JSON output and Word document generation.","Built data pipelines and SQL databases to track applications and outcomes; leveraged data processing to measure ATS compatibility and improve success rates.","Produced documentation and user guidance for deployment and testing; achieved measurable ATS scores across multiple checkers."]},{"title":"Drinks Ordering Web App","start_date":"August 2018","end_date":"September 2018","description":["Designed and deployed a web application to manage orders for a 100+ guest event, processing 80+ orders and eliminating queues through asynchronous updates (Ajax).","Implemented real-time status updates and backend data handling to ensure reliable operation under load.","Collected and analysed user feedback to iterate on the interface and improve usability."]},{"title":"Science YouTube Channel & Podcast","start_date":"June 2020","end_date":"March 2021","description":["Produced 11 episodes explaining technical topics (rocket propulsion, Magnus effect), demonstrating clear science communication and audience-focused content design.","Wrote and edited scripts, coordinated a small team and handled technical production logistics.","Achieved 10,000+ views across channels, showing ability to convey complex information accessibly to non-specialist audiences."]}],"skills":{"languages":["Python","MATLAB","C","SQL","Simulink","JSON","HTML/CSS/JavaScript"],"libraries":["NumPy","SciPy","Matplotlib","pydantic","jinja","SQLite"],"tools":["LabVIEW","Microsoft Office (Word, Excel)","Git / GitHub","Origin Pro"],"soft_skills":["Troubleshooting and fault diagnosis","Technical report writing","Customer-facing communication","Teamwork and collaboration","Organisation, planning and time management","Adaptability and quick learning"],"interests":["Machine learning","Amateur radio","Tennis","Chess","Debating"]}}