{"job_title":"Junior Field Service Support","company_name":"OTT HydroMet (a Veralto company)","industry":"Water quality / Environmental instrumentation (hydrology, meteorology, solar monitoring)","location":"Sheffield, UK (70–80% travel across the UK; occasional overseas trips)","essential_requirements":["Completed studies or technician training (preferably electrical engineering, ICT, or hydrometry/meteorology)","Valid driver's license","Good IT skills","Good spoken and written English (able to compile technical reports)","Ability to absorb and act upon technical information"],"preferred_requirements":["Basic electrical knowledge and experience","Experience working with sensors, data collectors, and data processing software","Experience with Python and/or Pascal programming"],"hard_skills":["Electrical basics (installation, wiring, fault diagnosis)","Sensor and data-logger installation and configuration","Field commissioning, maintenance and testing of hydro/meteorological/solar stations","Data processing and interpretation (use of data processing software)","Technical report writing and documentation","Use of IT tools (MS Office, Teams, email; scheduling/CRM basics)","Basic programming (Python and/or Pascal) — desirable","Workshop assembly and test procedures","Troubleshooting and diagnostics"],"soft_skills":["Customer-facing communication and liaison","Teamwork and collaboration (working with senior technicians and other departments)","Adaptability and willingness to travel frequently","Problem-solving and investigative mindset","Ability to learn quickly and follow technical instruction","Organisation, planning and time management","Attention to detail","Professionalism in customer interactions"],"ATS_keywords":["Junior Field Service","Field Service Technician","installation","maintenance","fault diagnosis","hydrometry","meteorology","hydro station","met station","solar station","sensors","data collectors","data logger","data processing","Python","Pascal","technical report","driver's license","UK travel","workshop","commissioning","troubleshooting","customer liaison","service quotes","MS Teams","Veralto","OTT HydroMet"],"key_responsibilities":["Support Senior Field Service Technicians on-site with installations, maintenance and fault diagnosis of hydro/meteorological/solar stations.","Build, test and commission equipment in the OTT workshop and prepare follow-up service reports/documentation for customers.","Liaise with customers and internal teams (sales, admin, support) to arrange site work, respond to service queries and support service quoting and visit planning."],"tools_and_technologies":["Hydro/meteorological/solar station hardware (sensors, data loggers, telemetry modules)","Workshop testing tools and instrumentation (multimeters, power supplies, test rigs)","Data processing software / data management tools","Python and/or Pascal (where used)","MS Office (Word, Excel), MS Teams, email/phone","Company vehicle (for frequent travel)","Service reporting / ticketing or CRM/scheduling tools"],"company_values":["Purpose-driven impact (safeguarding water and weather resources)","Collaboration and diversity","Problem-solving and inventive thinking","Customer-focus and service excellence","Growth, development and career progression","Environmental responsibility and public safety"],"tailoring_recommendations":["Use the job title (Junior Field Service Support / Field Service Technician) on your CV and in the cover letter.","Lead with relevant technician training/education (electrical engineering, ICT, hydrometry/meteorology) and confirm you hold a valid driver's license.","Highlight field/service experience: installations, commissioning, maintenance, fault diagnosis and overnight travel availability (quantify travel percentage or examples).","Call out experience with sensors, data loggers, telemetry and any data processing software by name; include any Python/Pascal or scripting experience.","Demonstrate customer-facing experience and give examples of technical reports or documentation you produced (attach sample or describe structure).","List IT skills (MS Office, Teams, email) and any workshop/test equipment you’ve used (multimeter, soldering, test rigs).","Include measurable outcomes (e.g., reduced downtime, number of installations completed, time-to-repair improvements) to show impact.","Emphasise soft skills sought: teamwork, problem-solving, adaptability, ability to learn and communicate technical information clearly.","Mirror key ATS keywords from the job description in your CV (installations, maintenance, fault diagnosis, sensors, data processing, Python, technical report).","If you lack direct experience, highlight transferable skills (electrical lab work, instrumentation, field placements) and eagerness to learn and undertake training."]}