{"job_title":"Software Engineer","company_name":"Meta","industry":"Technology / Social Media / AR/VR","location":"Not specified / Multiple locations","essential_requirements":["Programming experience in a relevant language","Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience","Demonstrated experience driving change within an organization and leading complex technical projects","Experience utilizing data and analysis to explain technical problems and provide detailed feedback and solutions","Ability to collaborate with cross-functional teams (product, design, operations, infrastructure)","Experience analyzing and optimizing code for quality, efficiency, and performance","Track record of establishing ownership of components, features, or systems with end-to-end understanding"],"preferred_requirements":["Experience with C, C++ or Java","Experience with scripting languages such as Python, JavaScript, or Hack","Experience improving quality via code reviews, testing, staged rollouts, monitoring, and proactive fixes","Experience building or operating large-scale infrastructure applications","Prior experience mentoring peers, setting technical direction, and onboarding new team members"],"hard_skills":["Proficiency in one or more programming languages (C, C++, Java, Python, JavaScript, Hack)","System architecture and scalable systems design","Performance tuning and scalability troubleshooting","Data-driven debugging and analysis (using telemetry/metrics/logs)","Code review and software quality practices","Testing strategy and rollout/monitoring practices","Full-stack development for web and mobile platforms","Distributed systems and large-scale infrastructure knowledge","Version control and CI/CD workflows"],"soft_skills":["Cross-functional collaboration","Technical leadership and mentorship","Ownership and accountability","Strategic thinking and goal-setting","Clear technical communication","Problem-solving and debugging mindset","Adaptability to varied languages/technologies","Influencing and driving organizational change"],"ATS_keywords":["Software Engineer","Meta","scalable systems","system architecture","performance optimization","code review","testing","monitoring","rollout","technical leadership","mentorship","distributed systems","infrastructure","C","C++","Java","Python","JavaScript","Hack","mobile","web applications","data-driven","technical projects","reduce technical debt","ownership"],"key_responsibilities":["Design and implement efficient, scalable systems and custom user interfaces across mobile and web platforms; own components or features end-to-end.","Collaborate with product, design, operations, and infrastructure teams to define requirements, ship features, and improve user experience while mentoring peers and onboarding teammates.","Analyze and optimize code for quality, efficiency and performance; drive large efforts to resolve performance/scalability issues, reduce technical debt, and improve reliability through testing, rollouts, and monitoring."],"tools_and_technologies":["Programming languages: C, C++, Java, Python, JavaScript, Hack","Web & mobile platforms (web apps, React/React Native-style stacks, native Android/iOS)","Distributed systems / large-scale infrastructure tooling","Version control (Git) and CI/CD pipelines","Testing frameworks and automated test suites","Monitoring and observability tools (metrics, logging, alerting)","Code review tools and development workflows"],"company_values":["Connecting people and building communities","Scale and impact — building technologies used by billions","Pushing boundaries of user experience and innovation","Ambition to move beyond screens toward immersive (AR/VR) experiences","Collaboration across product, design, research and engineering"],"tailoring_recommendations":["Use the exact ATS keywords from the posting (e.g., 'scalable systems', 'system architecture', 'performance optimization', 'code review', language names) in your resume summary and skills section.","Lead with measurable examples: quantify scale (users, requests/sec, latency improvements, cost savings, reduced technical debt) and scope of projects you owned.","Highlight languages and technologies called out (C/C++/Java/Python/JavaScript/Hack) and note familiarity with web/mobile stacks and infrastructure.","Demonstrate leadership: include examples of driving change, leading complex technical projects, mentoring or onboarding engineers, and setting team direction.","Show your data-driven approach: describe how you used metrics/telemetry to find, explain, and fix problems or validate rollouts.","Include code-quality practices: cite code review contributions, testing strategies, rollout procedures, and monitoring/alerting improvements.","If you lack a formal degree, explicitly document equivalent practical experience and major engineering outcomes to meet the 'or equivalent practical experience' requirement.","Keep the resume concise but technical — include system design bullet points and a short link to relevant code samples, architecture docs, or GitHub/open-source projects if available."]}