{

  "profile": "Upcoming Physics graduate from University of Warwick with strong analytical, programming, and problem-solving skills. Experienced in data analysis, simulation, and software development through academic and internship projects. Seeking a role in data science or applied AI.",
  "location": "London, UK",
  "education": [
    {
      "degree": "MPhys Physics",
      "institution": "University of Warwick",
      "location": "UK",
      "start_date": "October 2022",
      "end_date": "July 2026",
      "grade": "First (expected)",
      "description": [
          "Achieved 85% in year one, 89% in year two, 82% in year three.",
          "Relevant modules include scientific and high-performance computing, advanced mathematical methods, fluid mechanics, electromagnetism, quantum mechanics, condensed matter and statistical physics.",
          "Investigated the metastability of nucleation within the 2D Ising model by running dozens of Monte Carlo simulations in MATLAB, and co-authoring a paper with two other students within 3 weeks. Achieved 65% when marked by academic expert Prof. Rudolf Röemer.",
          "Numerically solved partial differential equations in C via finite difference methods to model heat flow through industrial pipes, achieving 95%.",
          "Ran over 10,000 simulations to model orbital stability with an N-body integrator Python module, implementing advanced data analysis via mean exponential growth of nearby orbits (MEGNO) for stability quantification, and post-processing techniques when interpreting results.",
          "Co-developed a stabilisation algorithm in LabVIEW with my lab partner for a nodding donkey system, developing PID control mechanisms from first principles. Achieved excellent stability and added additional code allowing the arm to change its angle. Achieved 86% overall.",
          "Led two group research projects with 6 members each on photovoltaic materials and photocathodes, including the importance of density functional theory to model them. Scheduled and chaired weekly meetings, and ensured tasks were delegated equally. Both projects received 70%+ overall.",
          "Designed, built and tested a DC voltage regulator circuit incorporating Op-Amps and MOSFET transistors."
      ]
    },

    {
      "degree": "A-levels",
      "institution": "Forest School",
      "location": "UK",
      "start_date": "September 2020",
      "end_date": "July 2022",
      "grade": "A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)",
      "description": [
          "Received sixth form valedictorian award for best academic performance.",
          "Produced a 5000-word extended research project on the extent to which renewable energy, nuclear power and geoengineering will mitigate the effects of climate change over the 21st century, achieving 100%.",
          "Presented the findings of my project in front of the entire sixth form cohort, consisting of 160+ students and staff, and received praise from over 40 students and staff afterwards, highlighting my exempleray communication and public speaking skills."
      ]
    }
  ],

  "experience": [

    {
      "title": "Undergaduate Researcher",
      "company": "Warwick Mathematics Institute",
      "location": "Coventry, UK",
      "start_date": "June 2025",
      "end_date": "October 2025",
      "description": [
        "Modelled finite difference methods for wave propagation in over 100+ aeroacoustics simulations, over the course of 3 months.",
        "Analysed performance of 10 maximal-order and dispersion relation preserving schemes in MATLAB, optimising for accuracy and computational effort",
        "Produced a 2-page poster outlining my research - displayed at a poster event."
      ]
    },

    {
      "title": "RF Seekers Summer Intern",
      "company": "MBDA UK",
      "location": "Stevenage, UK",
      "start_date": "June 2024",
      "end_date": "August 2024",
      "description": [
        "Interned for 10 weeks in the Modelling and Algorithms team, working on synthetic aperture radar (SAR) imagery processing chains within active electronically scanned array (AESA) radar systems.",
        "Optimised a matched filter algorithm in MATLAB by implementing the Fast Fourier Transform (FFT) method, reducing its runtime by 85% and significantly improving full-system performance.",
        "Co-developed a data analysis application enabling six colleagues to rapidly analyse range–Doppler images during a performance campaign, streamlining post-processing.",
        "Integrated a mid-fidelity range–Doppler imagery algorithm into the application to provide quick sanity checks against higher-fidelity algorithms.",
        "Researched over 10 papers and textbooks on AESA radar and SAR imagery to gain a deep understanding of the science and mathematics behind each sub-algorithm.",
        "Delivered over 50 commits to the project using professional software development practices and version control, becoming a key contributor to the model.",
        "Presented a placement review to 20+ colleagues, summarising technical outcomes and key contributions."
      ]
    },

    {
      "title": "Project Manager",
      "company": "Warwick Aerospace Society",
      "location": "Coventry, UK",
      "start_date": "January 2024",
      "end_date": "March 2025",
      "description": [
        "Managed a 12-member student team developing ultra-high frequency (UHF) satellite ground station systems.",
        "Led 30+ weekly meetings, established four specialised sub-teams, delegated roles, and provided weekly reports to senior leadership.",
        "Authored 30+ pages of documentation for a proof-of-concept passive UHF ground station (non-rotator) designed for NOAA weather satellite reception, incorporating Pugh matrices for antenna selection and producing a detailed bill of materials.",
        "Oversaw material procurement, design, and assembly of the proof-of-concept station in 10 weeks, coordinating efforts with the Chief Engineer.",
        "Initiated MATLAB/Simulink modelling of an advanced half-duplex UHF ground station with rotator control for CubeSat communication, utilising MATLAB's Satellite Communication toolbox.",
        "Implemented GitHub-based version control for model development, applying skills gained from RF Seekers internship experience."
      ]
    },

    {
      "title": "Fly Your Satellite Workshop",
      "company": "European Space Agency",
      "location": "Noordwijk, Netherlands",
      "start_date": "November 2024",
      "end_date": "November 2024",
      "description": [
        "Completed a 5-day workshop hosted by the European Space Agency (ESA) on developing CubeSat satellites, on behalf of the Aerospace Society.",
        "Attended 20 lectures exploring systems engineering and requirements practices, ground station communication methods etc.",
        "Visited the European Space Research and Technology Centre (ESTEC), experienced lectures from 6 technical experts working on multiple projects.",
        "Collaborated with a team of 10 students to simulate a CubeSat design sprint within 60 minutes, meeting all mission requirements under significant time pressure through effective delegation of tasks and communication.",
        "Gained further insight from 3 students on best practices to develop rotator-based half-duplex UHF ground station communications."
      ]
    },

    {
      "title": "Academic Coordinator",
      "company": "Warwick Physics Society",
      "location": "Coventry, UK",
      "start_date": "March 2024",
      "end_date": "March 2025",
      "description": [
        "Delivered 7 revision lectures for end-of-year exams.",
        "Organised a 10-year anniversary talk hosted by Prof Dame Athene Donald, attended by over 100 students and department academics.",
        "Explained complex ideas to an audience of approximately 100 students – received excellent feedback.",
        "Ran weekly academic support sessions, helping ."
      ]
    }

  ],

  "projects": [
    {
      "title": "AI CV Generator",
      "start_date": "July 2025",
      "end_date": "ongoing",
      "description": [
        "Developed a CV and cover letter generator with openAI's API in Python, tailoring to the job description.",
        "Incorporated Pydantic's BaseModel class to ensure a structured JSON format output, and used docxtpl to convert it into fully formatted word documents.",
        "Achieved scores above 50% in 3 ATS-checker websites, and resulted in 2 job offers after 200 applications.",
        "Developed 2 SQL databases to store ongoing job applications, and track progress."
      ]
    },

    {
      "title": "Science YouTube Channel & Podcast",
      "start_date": "June 2020",
      "end_date": "March 2021",
      "description": [
        "Founded and managed two science YouTube channels, Worked Example and The Sci-Cast.",
        "Produced 11 scientifically accurate video and podcast episodes on topics such as rocket propulsion, the Magnus effect, and rounding errors in missile defence, gaining 10,000+ total views.",
        "Wrote and delivered 11 engaging scripts, coordinating daily editorial tasks with my brother and managing a three-person podcast team.",
        "Earned school recognition for science communication work, with 5 teachers publicly commending and sharing the content."
      ]
    },

    {
      "title": "Drinks Ordering Web App",
      "start_date": "August 2018",
      "end_date": "September 2018",
      "description": [
        "Developed a web app for customers to order drinks at a party with over 100 guests.",
        "Processed 80+ orders over the course of 6 hours, and eliminated queues at the bar.",
        "Used Ajax to asynchronously update order statuses, informing people when their drinks were ready to collect.",
        "Received exceptional feedback from 2 software engineers at the party and all 3 bar staff."
      ]
    }
  ],

  "skills": {
    "languages": ["Python", "MATLAB", "Simulink", "C", "JSON", "SQL", "PHP", "HTML", "CSS", "JavaScript", "Ajax"],
    "libraries": ["NumPy", "SciPy", "SQLite", "Matplotlib", "openAI", "pydantic", "jinja"],
    "tools": ["Microsoft Office", "Git", "GitHub", "Origin Pro", "LabVIEW"],
    "soft_skills": ["Analytical thinking", "Teamwork", "Communication", "Problem-solving"],
    "interests": ["Machine learning", "Amateur radio", "Tennis", "Football", "Chess", "Debating"]
  }

  
}