{"hook_paragraph":"I am an MPhys Physics student at the University of Warwick (expected First, graduating July 2026) whose work in large‑scale simulation, quantitative modelling and algorithm optimisation has taught me to turn complex data into robust, actionable insight — the same mindset I am eager to bring to Castleton Commodities International’s Commodities Trading Rotational Analyst Programme. The prospect of rotating across trading desks and gaining structured exposure to risk management and proprietary trading excites me because it combines rigorous quantitative work with fast‑moving market decision making, precisely the environment I have trained for academically and in internships.","main_section":"Over the last four years I have built a practical toolkit that aligns closely with the responsibilities of this programme. I have extensive Python experience (project development, numerical analysis and API integration) and have designed SQL databases to track application data and support analytics in an ongoing CV‑generator project. My academic work includes running over 10,000 Monte Carlo simulations to study orbital stability, implementing MEGNO analysis in Python to quantify chaotic behaviour, and numerically solving partial differential equations in C using finite‑difference methods to model heat flow — all tasks that required careful model validation, parameter sensitivity testing and statistical interpretation.\n\nIn industry‑facing projects I have applied these skills to deliver measurable improvements. During a 10‑week placement at MBDA UK I optimised a matched‑filter algorithm in MATLAB by implementing FFT techniques, reducing runtime by 85% and improving the overall processing pipeline; I also contributed a data‑analysis application used by six colleagues and presented my work to a technical audience. As an undergraduate researcher at Warwick Mathematics Institute I modelled and benchmarked over 100 aeroacoustics simulations, analysing schemes for accuracy and computational cost and producing a research poster for a departmental event.\n\nThese experiences have given me a solid foundation in quantitative modelling, statistical analysis and software development — the tools required to design and back‑test trading strategies and to analyse market fundamentals. I am comfortable with uncertainty, accustomed to optimising code and models under resource constraints, and committed to rigorous risk control. Beyond technical abilities, I have led multi‑disciplinary student teams, chaired weekly project meetings as Project Manager for Warwick Aerospace Society, and delivered revision lectures and departmental talks; these roles demonstrate my ability to communicate complex ideas clearly and to add value within a team.\n\nWhile I have not yet worked directly in commodity markets, my A‑level extended project on energy technologies and my broader interest in energy and climate topics motivate me to specialise in this sector. I welcome the opportunity to learn from Castleton’s trading and risk teams, and I am prepared to demonstrate my Python and SQL skills in technical interviews. Thank you for considering my application — I would be pleased to discuss how my quantitative background and practical programming experience can contribute to CCI’s trading desks and to the firm’s development of trading talent."}