{
  "title": "Commodities Trading Rotational Analyst Graduate Programme 2026",
  "company": "Castleton Commodities International",
  "deadline": "07/10/2025",
  "description": "Castleton Commodities International is a leading global energy commodities merchant and infrastructure asset investor. As a trader, CCI deploys capital on a proprietary basis in the physical and financial commodity markets, providing the Company with market insights and access. As a strategic investor and developer, CCI leverages its market expertise, operations capabilities, and industry knowledge to invest in, and develop, select commodity infrastructure assets. CCI focuses its activities on the markets it understands best, while constantly striving to expand its knowledge base and network of relationships in order to participate in new markets.\nHeadquartered in Stamford, Connecticut, CCI conducts business from offices located around the world including Calgary, Canada; Houston, Texas; New York, New York; Geneva, Switzerland; London, United Kingdom; and Singapore. The Company has more than 500 employees globally.\nProgramme overview\nThroughout the programme, participants will also have regular interaction with the leaders of our businesses to gain an understanding of our approach to various opportunities across global markets.\nThis is a two-year rotational programme where for analysts to gain exposure to the support functions around trading with a specific emphasis on risk.  From there, participants will rotate among four different trading desks, one of which could include the Risk team.  At any point during the trading rotation—the desk can extend an offer of employment to the analyst and if they accept the offer, the analyst would no longer rotate to the next desk.\nThis programme is a unique opportunity designed to provide a strong basis for a role within the business, and to identify and develop people who have the desire to become active players in the company.  Graduates will be exposed to the fundamental components of the global commodities industry.\nRequirements\nAt CCI, we are dedicated to attracting and retaining top talent. We value our human capital and seek strong contributors whom we can support and provide with the opportunities to be successful. We are seeking individuals who have strong technical skills along with an understanding of derivative products and an interest in the commodity markets.\nResponsibilities (Trading/Analysis)\nAnalyse markets to identify trading opportunities, analysing and understanding risks\nDesign and develop models to analyse economic data, market fundamentals and forecast prices\nPerform research and statistical studies of identified risk factors\nIdentify market pricing trends and discontinuity\nDesign and formulate trade ideas and execute with rigorous risk management control. Run back-testing to verify the strategy prior to production execution\nReview research reports and articles that examine recent developments in the energy markets\nBuild up close connection with external consultancies and internal research team\nQualifications\nPursuing Bachelors or Master’s in Mathematics, Engineering, Finance, Statistics, Business, Economics, Energy, Computer Science, Physics or a related field of study\nExpected graduation date in Spring/Summer 2026\nPrior internship/exposure to the commodities markets, or experience with other financial institutions and consulting is preferred\nExcellent analytical and technical skills in one or more of the following: Python, R, Matlab, C++, VBA, Excel—as well as SQL or other database exposure. Python is the preferred programming language. Should you be selected for interviews, be prepared to review Python and SQL.\nSuperior communication skills, both verbal and written\nAbility to work as an effective team player and add value to team\nEmployee programs & benefits\nCCI offers competitive benefits and programs to support our employees, their families and local communities. These include:\nCompetitive comprehensive medical, dental, retirement and life insurance benefits\nEmployee assistance & wellness programs\nParental and family leave policies\nCCI in the Community: Each office has a Charity Committee and as a part of this program employees are allocated 2 days annually to volunteer at the selected charities.\nCharitable contribution match program\nTuition assistance & reimbursement\nQuarterly Innovation & Collaboration Awards\nEmployee discount program, including access to fitness facilities\nCompetitive paid time off\nContinued learning opportunities",
  "essential_requirements": [
    "Pursuing a Bachelor's or Master's in Mathematics, Engineering, Finance, Statistics, Business, Economics, Energy, Computer Science, Physics or related field",
    "Expected graduation date Spring/Summer 2026",
    "Strong technical skills and quantitative ability (experience in one or more programming / analysis languages required)",
    "Understanding of derivative products and interest in commodity markets",
    "Proficiency/preparedness in Python (preferred) and SQL — candidates should be prepared to review Python and SQL in interviews",
    "Superior verbal and written communication skills",
    "Ability to work effectively as a team player and add value to a trading/analysis team",
    "Capacity to design/develop models, perform statistical research and run back-testing with rigorous risk management controls"
  ],
  "preferred_requirements": [
    "Prior internship or exposure to the commodities markets",
    "Prior experience with other financial institutions or consulting",
    "Experience working on trading desks, risk teams or in commodity research",
    "Familiarity with market fundamentals and energy markets specifically"
  ],
  "hard_skills": [
    "Python (preferred)",
    "SQL and database exposure",
    "R",
    "Matlab",
    "C++",
    "VBA",
    "Excel (advanced)",
    "Statistical analysis and econometrics",
    "Quantitative modelling and forecasting",
    "Back-testing strategies",
    "Risk management and derivatives knowledge",
    "Market analysis and price discovery",
    "Data manipulation and research"
  ],
  "soft_skills": [
    "Strong analytical thinking and problem-solving",
    "Clear verbal and written communication",
    "Teamwork and collaboration",
    "Attention to detail",
    "Adaptability (rotational programme environment)",
    "Stakeholder engagement (internal and external)",
    "Initiative and learning orientation"
  ],
  "ATS_keywords": [
    "Castleton Commodities International",
    "CCI",
    "trader",
    "trading",
    "commodities",
    "energy markets",
    "risk",
    "risk management",
    "derivatives",
    "Python",
    "SQL",
    "R",
    "Matlab",
    "C++",
    "VBA",
    "Excel",
    "back-testing",
    "market analysis",
    "forecast",
    "quantitative",
    "statistical",
    "modeling",
    "research",
    "trading desk",
    "rotational programme",
    "internship",
    "finance",
    "economics",
    "expected graduation 2026"
  ],
  "key_responsibilities": [
    "Analyze global commodity markets and identify trading opportunities and associated risks, including pricing trends and discontinuities",
    "Design, develop and validate quantitative models to analyse fundamentals, forecast prices and run back-testing to verify trading strategies",
    "Formulate and execute trade ideas with rigorous risk management controls while collaborating with internal research teams and external consultancies"
  ],
  "tools_and_technologies": [
    "Python (preferred)",
    "SQL / relational databases",
    "R",
    "Matlab",
    "C++",
    "VBA",
    "Microsoft Excel (advanced)",
    "Back-testing frameworks and statistical libraries (e.g., pandas, NumPy, scikit-learn — implied)",
    "Internal trading desk tools / research platforms (implied)"
  ],
  "company_values": [
    "Attracting and developing top talent",
    "Collaboration and cross-team engagement",
    "Innovation (Quarterly Innovation & Collaboration Awards)",
    "Community involvement and volunteerism (Charity Committees, volunteer days)",
    "Employee support and wellbeing (comprehensive benefits, parental leave, wellness programs)",
    "Continuous learning and professional development"
  ],
  "tailoring_recommendations": [
    "Lead with education and expected graduation date (Spring/Summer 2026) in the header so it matches the requirement",
    "Prioritise and detail Python and SQL experience—list projects, libraries used, and be prepared to walk through code or queries in interviews",
    "Showcase relevant internships, consulting or finance experience, especially any exposure to commodities, trading desks or risk teams",
    "Include concrete examples of quantitative models, forecasting work, back-testing results and measurable outcomes (e.g., % improvement, forecast accuracy)",
    "Use ATS keywords from the job description in the resume summary, skills and experience sections (commodities, derivatives, trading, risk management, back-testing)",
    "Emphasise communication and teamwork: describe cross-functional collaboration, presentations to stakeholders or leadership exposure",
    "Highlight any energy/commodity-specific coursework, certifications or research",
    "If space allows, include community or extracurricular leadership to mirror company emphasis on volunteerism and collaboration",
    "Keep descriptions concise and results-oriented, and tailor a short cover note expressing interest in the rotational trading programme and long‑term trading career"
  ]
}