{"profile":"Upcoming MPhys Physics graduate targeting Trading Desk Operations Engineer (TDOE) roles. Experienced in technical coding, data queries and supporting production workflows — building tools and optimising infrastructure using Python, MATLAB and SQL. Collaborative, curious problem-solver with strong communication and stakeholder coordination.","education":[{"degree":"MPhys Physics","institution":"University of Warwick","location":"UK","start_date":"October 2022","end_date":"July 2026","grade":"First (expected)","description":["Achieved high marks across years one to three (85%, 89%, 82%).","Relevant modules: scientific and high-performance computing, advanced mathematical methods, fluid mechanics, electromagnetism, quantum mechanics, condensed matter and statistical physics.","Extensive numerical and simulation work: Monte Carlo simulations for 2D Ising model, N-body integrator with 10,000+ runs and MEGNO analysis, and a C finite-difference PDE solver modelling industrial heat flow.","Co-developed a LabVIEW stabilisation algorithm with PID control and led two 6-member group research projects, scheduling meetings and delegating tasks."]},{"degree":"A-levels","institution":"Forest School","location":"UK","start_date":"September 2020","end_date":"July 2022","grade":"A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)","description":["Sixth form valedictorian award for academic performance.","Extended Project (5000 words) on renewable energy, nuclear power and geoengineering, graded 100%.","Presented project findings to a cohort of 160+ students and staff, demonstrating clear verbal communication and public speaking."]}],"work_experience":[{"title":"Undergraduate Researcher","company":"Warwick Mathematics Institute","location":"Coventry, UK","start_date":"June 2025","end_date":"October 2025","description":["Modelled finite-difference methods for wave propagation in 100+ aeroacoustics simulations using MATLAB over a three-month research placement.","Analysed and benchmarked 10 maximal-order and dispersion-relation-preserving schemes, optimising accuracy versus computational cost.","Communicated results via a poster presentation and technical summary to academic stakeholders."]},{"title":"Project Manager","company":"Warwick Aerospace Society","location":"Coventry, UK","start_date":"January 2024","end_date":"March 2025","description":["Managed a 12-member team to design and deliver a proof-of-concept UHF satellite ground station, coordinating procurement, assembly and testing within a 10-week build window.","Implemented GitHub-based version control for model development and authored 30+ pages of technical documentation and bill of materials.","Chaired weekly meetings, formed four specialised sub-teams and reported progress to senior leadership, improving cross-team collaboration and task prioritisation.","Initiated MATLAB/Simulink modelling of rotator control for half-duplex communications, integrating modelling with hardware design decisions."]},{"title":"RF Seekers Summer Intern","company":"MBDA UK","location":"Stevenage, UK","start_date":"June 2024","end_date":"August 2024","description":["10-week placement in the Modelling and Algorithms team working on synthetic aperture radar (SAR) processing chains for AESA systems.","Optimised a matched-filter algorithm in MATLAB by implementing an FFT approach, reducing runtime by 85% and improving overall pipeline performance.","Co-developed a data-analysis application used by six colleagues to rapidly inspect range–Doppler images during campaigns; maintained the codebase with 50+ commits using version control.","Presented technical outcomes to 20+ colleagues and documented work to support handover and subsequent development."]}],"projects":[{"title":"AI CV Generator","start_date":"July 2025","end_date":"ongoing","description":["Developed a CV and cover-letter generator using OpenAI's API in Python, producing structured JSON outputs validated with Pydantic and rendered to Word via docxtpl.","Built two SQL databases to store and track job applications and outcomes; achieved >50% on three ATS-checker sites and contributed to two job offers after 200 applications.","Maintained the project with version control and implemented input validation and structured outputs for robust downstream use."]},{"title":"Drinks Ordering Web App","start_date":"August 2018","end_date":"September 2018","description":["Developed a web application to process 80+ orders at a 100+ guest event, eliminating queues and streamlining operations.","Implemented Ajax-based asynchronous updates to notify customers when orders were ready, improving real-time workflow.","Designed and tested frontend and backend components during a live event, collecting user feedback and iterating quickly."]}],"skills":{"languages":["Python","MATLAB","C","SQL","HTML","CSS","JavaScript","JSON"],"libraries":["NumPy","SciPy","Matplotlib","SQLite","pydantic","docxtpl","openAI"],"tools":["Git","GitHub","LabVIEW","Simulink","Microsoft Office","Origin Pro"],"soft_skills":["Critical thinking","Collaborative teamwork","Adaptability and prioritisation","Clear verbal and written communication","Reliable, 'no job too small' attitude","Mentorship and leadership experience"],"interests":["Machine learning","Amateur radio","Tennis","Chess","Debating"]}}