{
  "title": "Trading Desk Operations Engineer",
  "company": "Jane Street",
  "deadline": "rolling",
  "description": "About the Position\nWe are looking for individuals eager to use their technical, organizational, and communication skills in a fast-paced environment to join our TDOE team. Our TDOEs are integral to the firm’s success, building and maintaining desk infrastructure that supports the trading of thousands of financial products across 200 venues in over 45 countries.\nTrading Desk Operations Engineers wear many hats, helping to manage the operational side of the trading desk’s activities and interfacing with various groups within the firm to ensure our work is accurate and efficient. You’ll work alongside traders and developers to take on projects like: \nManaging and optimizing infrastructure and operational processes\nSupporting trading systems and workflows by executing data queries and coordinating with stakeholders\nDesigning and implementing solutions for a range of trading and operational-related issues on the desk  \nCommunicating with clearing firms and external counterparties to settle and clear trades\nOur trading desks are central to our collaborative office environment, and we believe the best way to integrate new hires is through a hands-on, interactive approach. You’ll receive mentorship from other TDOEs, traders, and developers as you take part in a number of development and training programs over your first few months. We don’t expect you to have a background in finance or any other specific field — we’re looking for curious people who enjoy solving interesting problems. We’re more interested in how you think and learn than what you currently know. \nIt’s important to emphasize the hands-on nature of this role; you’ll be building the tools that allow our firm to operate smoothly and execute trades efficiently. You’ll utilize technical coding, skilled organization, and collaborative problem-solving to deliver smart, innovative solutions that make our trading better. \nWe believe that good ideas come from anywhere and are always open to new ways of thinking. The impact you will have on the firm will only increase as you gain experience and proficiency in your specific expertise. \nAbout You\nA critical thinker with a strong technical foundation and an interest in expanding your programming skills\nAble to use technical knowledge and strong collaboration skills to reach solutions\nAn agile and adaptive problem solver\nHumble about what you know and don’t know; eager to ask questions and learn new things\nA reliable team player with a “no job too small” attitude\nExcellent verbal and written communication\nAble to balance competing priorities in a fast-paced environment\nInterested in finance and has a passion for STEM\nFluent in English",
  "essential_requirements": [
    "Strong technical foundation with ability to learn and expand programming skills",
    "Experience or comfort with technical coding and building tools",
    "Ability to execute data queries and support trading workflows",
    "Strong verbal and written communication skills (fluent in English)",
    "Collaborative mindset; ability to work with traders, developers, and other stakeholders",
    "Reliable, adaptable problem solver able to balance competing priorities in a fast-paced environment",
    "Curiosity and eagerness to learn (humble about knowledge gaps)",
    "Interest in finance and a passion for STEM"
  ],
  "preferred_requirements": [
    "Hands-on experience managing or optimizing infrastructure and operational processes",
    "Experience designing and implementing technical solutions for business or trading problems",
    "Experience interacting with external counterparties or clearing firms",
    "Prior exposure to trading systems, workflows, or financial product lifecycle",
    "Mentorship or collaborative training experience"
  ],
  "hard_skills": [
    "Programming / technical coding",
    "Data querying (e.g., SQL or similar query languages)",
    "Troubleshooting and supporting production trading systems/workflows",
    "Design and implementation of operational solutions",
    "Operational infrastructure management and optimization",
    "Coordinating technical work with stakeholders"
  ],
  "soft_skills": [
    "Critical thinking",
    "Collaborative teamwork",
    "Adaptability / agility",
    "Humility and eagerness to learn",
    "Reliability and a 'no job too small' attitude",
    "Strong verbal and written communication",
    "Prioritization and time management under pressure",
    "Curiosity and problem-solving orientation"
  ],
  "ATS_keywords": [
    "Trading Desk Operations Engineer",
    "TDOE",
    "trading desk",
    "trading systems",
    "infrastructure",
    "operational processes",
    "data queries",
    "stakeholder coordination",
    "design and implement",
    "clear trades",
    "clearing firms",
    "counterparties",
    "technical coding",
    "supporting workflows",
    "mentorship",
    "finance",
    "STEM",
    "collaboration",
    "problem solving"
  ],
  "key_responsibilities": [
    "Manage and optimize desk infrastructure and operational processes to support trading across venues",
    "Support trading systems and workflows by running data queries, troubleshooting issues, and coordinating with internal and external stakeholders",
    "Design and implement technical solutions for trading and operational problems; communicate with clearing firms/counterparties to settle and clear trades"
  ],
  "tools_and_technologies": [
    "Programming / scripting languages (general coding for tool development)",
    "Data query tools / query languages (e.g., SQL or equivalent)",
    "Trading systems and desk infrastructure platforms",
    "APIs / integration points for external counterparties and clearing firms",
    "Monitoring and operational support tooling (incident/tracking systems)",
    "Version control and collaboration tools (e.g., Git, ticketing/communication platforms)"
  ],
  "company_values": [
    "Collaboration and hands-on teamwork",
    "Mentorship and training for new hires",
    "Openness to ideas and inclusive contribution",
    "Practical problem solving and operational excellence",
    "Humility, continuous learning, and curiosity",
    "Reliability and ownership"
  ],
  "tailoring_recommendations": [
    "Lead with examples showing technical coding projects or tools you've built — emphasize hands-on work and outcomes (metrics where possible).",
    "Highlight experience running data queries and supporting production workflows; name specific query languages or tools if applicable.",
    "Show collaboration with traders, developers, or cross‑functional stakeholders; describe how you coordinated or communicated during incidents or projects.",
    "If you have any exposure to trading systems, clearing/settlement processes, or working with counterparties, make it explicit.",
    "Use ATS keywords from the job description (e.g., Trading Desk Operations Engineer, trading systems, infrastructure, data queries, clearing firms) in your resume and cover letter.",
    "Demonstrate soft skills: give short examples of being adaptable, humble, and a reliable team player (mentorship, on-call support, prioritization under pressure).",
    "If lacking finance experience, emphasize STEM background, technical curiosity, and quick learning — reference training programs or rapid ramp-up examples.",
    "Include relevant tools/technologies you’ve used (programming languages, SQL, Git, monitoring/incident tools) and preferred communication channels (Slack, email, ticketing systems)."
  ]
}