{
  "title": "Macquarie Asset Management Graduate Programme 2026",
  "company": "Macquarie",
  "deadline": "31/07/2025",
  "description": "Our Macquarie Asset Management teams focus on generating positive outcomes and seek to deliver superior results over the long term for our clients, portfolio companies, and communities. We provide access to specialist investment expertise across a range of capabilities including fixed income, equities, multi-asset solutions, private credit, infrastructure, green investments, natural assets, real estate, and asset finance. \nAt Macquarie, we are working to create lasting value for our communities, our clients and our people. We are a global financial services group operating in 31 markets and with 56 years of unbroken profitability. You’ll be part of a supportive team where everyone - no matter what role - contributes ideas and drive outcomes.  \nWhat role will you play? \nAs a graduate in Macquarie Asset Management, you’ll be a part of providing investment solutions to a broad range of clients. You’ll play a role in managing critical infrastructure assets like electricity networks, renewable energy platforms, data centers, port terminals and other essential businesses.  \nWe are currently hiring in the following areas:  \nClient Solutions Group provides clients a single point of contact across the breadth of our asset management platform including strategic partnerships, institutional and international wealth distribution, wealth product, marketing and communications.  \nMacquarie Asset Management Risk supports the business in providing risk guidance on transactions, new products and opportunities and implementing a strong risk management framework. \nWhat does our Programme offer?  \nJoining the Macquarie Graduate Programme, you’ll have the opportunity to immerse yourself in the financial services industry and build the technical skills and knowledge that will help you discover more for your career.  \nDuring this twelve-month programme, you’ll be encouraged to examine problems from every angle, challenge the status quo and come up with new and innovative ways of progressing our business while being supported by an inclusive team.  \nAs part of this programme, you’ll:  \nDevelop and utilise new skills while working side-by-side with our business leaders, learning on the job and working on transactions from day one  \nDevelop your technical skills and business knowledge, as well participate in internal and external training with the opportunity to build your network  \nBe encouraged to give back through the Graduate Volunteer Network and the Macquarie Group Foundation which provides support to hundreds of community organisations each year through financial support, volunteering and skills sharing.  \nWhat you offer  \nYou have a unique perspective. We want to hear it. We welcome applications from students from all degree backgrounds in their final year and completing their studies before summer 2026.    \nWe welcome applications from students with all degree backgrounds in their penultimate year of study.  \nNo prior financial experience is required, just an innate curiosity and eagerness to learn.  \nWhat we offer \nAt Macquarie, you’re empowered to shape a career that’s rewarding in all the ways that matter most to you. Macquarie employees can access a wide range of benefits which, depending on eligibility criteria, include: \n1 wellbeing leave day per year and a minimum of 25 days of annual leave. \n26 weeks’ paid parental leave for primary caregivers along with 12 days of paid transition leave upon return to work and 6 weeks’ paid leave for secondary caregivers \nPaid fertility leave for those undergoing or supporting fertility treatment \n2 days of paid volunteer leave and donation matching \nAccess to a wide range of salary sacrificing options \nBenefits and initiatives to support your physical, mental and financial wellbeing including, comprehensive medical and life insurance cover \nAccess to our Employee Assistance Program, a robust behavioural health network with counselling and coaching services \nAccess to a wide range of learning and development opportunities, including reimbursement for professional membership or subscription \nAccess to company funded emergency and backup dependent care services \nRecognition and service awards \nHybrid and flexible working arrangements, dependent on role \nReimbursement for work from home equipment \nHow to apply  \nApplications close on 31 October 2025 we recommend that you submit your application as early as possible as we recruit on a rolling basis.   \nWe love hearing from anyone inspired to build a better future with us. To be considered for this opportunity, you must complete your application through the Macquarie website at www.macquarie.com/careers.  \nOur commitment to diversity, equity and inclusion \nWe are committed to providing a working environment that embraces diversity, equity, and inclusion. We encourage people from all backgrounds to apply regardless of their identity, including age, disability, neurodiversity, gender (including gender identity or expression), sexual orientation, marriage or civil partnership, pregnancy, parental status, race (including ethnic or national origin), religion or belief, or socio-economic background. We welcome further discussions on how you can feel included and belong at Macquarie as you progress through our recruitment process. \nOur aim is to provide reasonable adjustments to individuals as required during the recruitment process and in the course of employment. If you require additional assistance, please let us know during the application process. ",
  "essential_requirements": [
    "Be in final year of study and completing studies before summer 2026 or be in penultimate year of study",
    "Ability to start and participate in the full 12-month Macquarie Graduate Programme",
    "Innate curiosity and eagerness to learn (no prior financial experience required)",
    "Willingness to work collaboratively in inclusive, team-based environments",
    "Right to work in the location(s) where the programme is offered (implied by application requirement)"
  ],
  "preferred_requirements": [
    "Interest in or enthusiasm for asset management, infrastructure and related asset classes (electricity networks, renewables, data centres, port terminals, etc.)",
    "Interest in client-facing roles or risk functions (Client Solutions or Asset Management Risk)",
    "Volunteer or community engagement experience (Graduate Volunteer Network / Macquarie Group Foundation alignment)",
    "Demonstrated ability to learn on the job and adapt to new challenges",
    "Availability to apply early (applications are reviewed on a rolling basis)"
  ],
  "hard_skills": [
    "Basic financial and commercial literacy (ability to learn investment concepts quickly)",
    "Analytical and quantitative skills (data analysis, problem-solving)",
    "Transaction support fundamentals (ability to assist on deals/transactions)",
    "Risk awareness and basic risk-management concepts (for Risk stream applicants)",
    "Professional business communication and presentation skills"
  ],
  "soft_skills": [
    "Curiosity and a growth mindset",
    "Teamwork and collaboration",
    "Adaptability and flexibility (hybrid/flexible working arrangements)",
    "Effective verbal and written communication",
    "Problem-solving and critical thinking",
    "Initiative and willingness to challenge the status quo",
    "Commitment to diversity, equity and inclusion"
  ],
  "ATS_keywords": [
    "Macquarie Asset Management",
    "Macquarie Graduate Programme",
    "graduate",
    "Client Solutions Group",
    "Asset Management Risk",
    "infrastructure",
    "renewable energy",
    "data centres",
    "port terminals",
    "transactions",
    "risk management",
    "investment solutions",
    "asset management",
    "community",
    "volunteer",
    "Macquarie Group Foundation",
    "diversity",
    "inclusion",
    "hybrid",
    "12-month programme",
    "technical skills",
    "learning and development"
  ],
  "key_responsibilities": [
    "Support and contribute to transaction work and investment solutions across Macquarie Asset Management assets (e.g., infrastructure, renewables, data centres) from day one",
    "Develop technical skills and business knowledge through on-the-job learning, internal/external training and working side-by-side with business leaders",
    "Provide or support risk guidance and help implement strong risk management practices (particularly for those in Asset Management Risk) or act as a single point of contact for clients across the platform (for Client Solutions)"
  ],
  "tools_and_technologies": [
    "Microsoft Office suite (Excel, PowerPoint, Word) — implied for analysis and presentations",
    "Remote collaboration tools (Microsoft Teams, Zoom) — implied for hybrid working",
    "Internal learning platforms and training systems (company LMS)",
    "Standard deal / transaction documentation and risk frameworks (industry-standard tools/processes)",
    "CRM and client communication tools (for Client Solutions roles, implied)"
  ],
  "company_values": [
    "Create lasting value for clients, communities and people",
    "Long-term performance orientation (delivering superior results over the long term)",
    "Collaboration and supportive team culture",
    "Innovation and challenging the status quo",
    "Commitment to diversity, equity and inclusion",
    "Giving back to communities (volunteering and philanthropy through Macquarie Group Foundation)"
  ],
  "tailoring_recommendations": [
    "Lead with eligibility: clearly state your expected graduation date to confirm you meet the programme timing requirements.",
    "Highlight curiosity and eagerness to learn: provide concrete examples of quickly learning new technical concepts, tools or frameworks (coursework, projects, internships, self-study).",
    "If applying to Client Solutions or Risk, tailor a short paragraph showing relevant interest/experience (e.g., client-facing projects, risk analysis coursework or group projects related to infrastructure/finance).",
    "Include examples of teamwork, problem-solving and times you challenged existing approaches or improved a process.",
    "Demonstrate community engagement or volunteering experience to align with Macquarie’s emphasis on giving back.",
    "Use ATS keywords from the job description (e.g., Macquarie Asset Management, transactions, risk management, infrastructure, graduate programme) naturally throughout your CV and cover letter.",
    "Quantify achievements where possible (project outcomes, metrics, scope) to show impact and commercial awareness.",
    "Keep applications concise and apply early (roles recruited on a rolling basis); complete the application via the Macquarie careers site as required."
  ]
}