{"hook_paragraph":"Jane Street’s model of researchers, engineers and traders working feet apart to turn careful experiment design into live, actionable strategies resonates strongly with me. As an upcoming Physics graduate from the University of Warwick who has repeatedly built, optimised and deployed numerical models and data pipelines in Python and MATLAB, I am excited by the opportunity to apply that analytical rigour and practical engineering mindset to quantitative research and trading.","main_section":"My technical experience centres on building robust, performance-conscious code and designing experiments to extract reliable signals from complex data. During a 10-week internship in MBDA’s Modelling and Algorithms team I optimised a matched-filter algorithm using FFT methods, cutting runtime by 85% and materially improving system throughput. I have developed complete data-processing applications (delivering 50+ commits and professional version-control practices) to enable fast analysis of range–Doppler imagery, and I regularly use Python for numerical work: examples include a bespoke N-body integrator and MEGNO-based stability analysis with over 10,000 simulations, and an ongoing AI CV generator where I used Python, OpenAI’s API and SQL to build end-to-end pipelines. I have also implemented finite-difference solvers in C for PDE problems, demonstrating attention to numerical accuracy and computational efficiency.\n\nI am comfortable designing experiments and constructing datasets: my undergraduate research involved systematically testing over 100 aeroacoustic simulations to compare numerical schemes, and my project work has required careful post-processing, validation and presentation of results. These experiences map directly to experiment design, feature engineering and model evaluation — I think of modelling as a cycle of hypothesis, controlled data-generation, quantitative comparison and pragmatic iteration.\n\nCollaboration and clear communication have been recurring themes in my roles. As Project Manager for the Warwick Aerospace Society I led a 12-person team through weekly sprints, produced detailed technical documentation and coordinated hardware and software integration. At Warwick I have also delivered revision lectures and run academic support sessions, experience that underpins my ability to explain technical trade-offs and mentor peers. At MBDA I presented technical outcomes to colleagues and integrated algorithms into a wider analysis toolchain, mirroring the interdisciplinary work between researchers, engineers and traders at Jane Street.\n\nI have strong foundations in Python, numerical methods, statistical reasoning and software engineering, and I am eager to learn finance-specific time series techniques, hyperparameter tuning and distributed training workflows. While I have not yet worked in financial markets, my track record of quickly absorbing new domains (radar imagery, satellite communications and numerical acoustics) and iterating from mistakes gives me confidence that I can contribute meaningfully to model building and the translation of research into actionable strategies.\n\nThank you for considering my application. I would welcome the chance to discuss how my quantitative software and modelling experience, collaborative approach and curiosity-driven mindset could support Jane Street’s research efforts."}