{
  "title": "Quantitative Researcher 2026",
  "company": "jane street",
  "deadline": "roooo",
  "description": "We are looking for Quantitative Researchers to help us build models, strategies, and systems that price and trade financial instruments. You’ll work side by side with experienced researchers who are committed to teaching, guiding, and supporting our newest hires, learning how we think about experiment design, dataset generation, time series analysis, feature engineering, and model building for financial datasets.\nAt Jane Street, our researchers, engineers, and traders sit a few feet away from each other and work together to train models, architect systems, and run trading strategies. We work with petabytes of data, a computing cluster with hundreds of thousands of cores, and a growing GPU cluster containing thousands of high-end GPUs. Depending on the day, we might be diving deep into market data, tuning hyperparameters, debugging distributed training performance, or studying how our model likes to trade in production.\nWe don’t believe in “one-size-fits-all” modeling solutions; we are open to and excited about applying all different types of statistical and ML techniques, from linear models to deep learning, depending on what best fits a given problem. The most successful researchers will be driven by a curiosity for how their contributions fit into the larger picture of our trading operations, and how to adapt their findings into actionable strategies.\nAbout you\nIf you’ve never thought about a career in finance, you’re in good company. Many of us were in the same position before working here. If you have a curious mind and a passion for solving interesting problems, we have a feeling you’ll fit right in. You should be:\nAble to apply logical and mathematical thinking to all kinds of problems\nIntellectually curious; eager to ask questions, admit mistakes, and learn new things \nA strong programmer who’s comfortable with Python\nAn open-minded thinker and precise communicator who enjoys collaborating with colleagues from a wide range of backgrounds and areas of expertise\nFluent in English\nMost candidates will have experience with data science or machine learning, but ultimately, we’re more interested in how you think and learn, than what you currently know. PhD or other research experience is a plus.",
  "essential_requirements": [
    "Strong programming ability in Python",
    "Ability to apply logical and mathematical thinking to problems",
    "Experience with data science or machine learning (most candidates)",
    "Familiarity with time series analysis, feature engineering, and model building for financial datasets (or demonstrated ability to learn these)",
    "Intellectual curiosity and eagerness to learn/admit mistakes",
    "Excellent communication skills and ability to collaborate across disciplines",
    "Fluency in English"
  ],
  "preferred_requirements": [
    "PhD or other formal research experience",
    "Experience working with large-scale datasets (petabyte-scale) and high-performance compute clusters",
    "Experience with GPU-based training and tuning deep learning models",
    "Experience with distributed training and debugging distributed training performance",
    "Practical experience applying ML/statistical techniques to finance or trading",
    "Experience mentoring or teaching junior researchers/hires"
  ],
  "hard_skills": [
    "Python programming",
    "Machine learning and statistical modeling",
    "Time series analysis",
    "Feature engineering for financial data",
    "Experiment design and dataset generation",
    "Model selection and hyperparameter tuning",
    "Working with large-scale data and high-performance compute resources",
    "Distributed training and performance debugging",
    "Model evaluation and production monitoring",
    "Quantitative/financial modeling (pricing/trading concepts)"
  ],
  "soft_skills": [
    "Intellectual curiosity",
    "Analytical and logical thinking",
    "Clear and precise verbal/written communication",
    "Open-mindedness and willingness to learn",
    "Collaboration and teamwork across researchers, engineers, and traders",
    "Adaptability and practical focus on actionable results",
    "Mentoring and teaching mentality"
  ],
  "ATS_keywords": [
    "Quantitative Researcher",
    "quantitative research",
    "machine learning",
    "data science",
    "time series analysis",
    "feature engineering",
    "Python",
    "deep learning",
    "statistical modeling",
    "hyperparameter tuning",
    "distributed training",
    "GPU cluster",
    "high-performance computing",
    "petabytes",
    "experiment design",
    "model building",
    "model deployment",
    "trading strategies",
    "financial instruments",
    "quantitative finance",
    "PhD",
    "research"
  ],
  "key_responsibilities": [
    "Design, build and validate models, strategies and systems to price and trade financial instruments (including feature engineering and time series modeling).",
    "Collaborate closely with researchers, engineers, and traders to train models, tune hyperparameters, debug distributed training and integrate models into production trading systems.",
    "Lead experiment design and dataset generation, analyze results, and translate research findings into actionable trading strategies and operational improvements."
  ],
  "tools_and_technologies": [
    "Python (primary programming language)",
    "Deep learning frameworks (e.g., PyTorch, TensorFlow) for model development",
    "Distributed training frameworks and orchestration (e.g., Horovod, Ray, Kubernetes, Slurm - likely)",
    "High-performance compute clusters and GPU clusters (thousands of GPUs)",
    "Big-data tooling / processing frameworks (e.g., Spark, Dask — likely) and large-scale data storage",
    "Version control (Git) and experiment tracking (e.g., MLflow, Weights & Biases - recommended)",
    "Monitoring and production tooling for model behavior and trading systems"
  ],
  "company_values": [
    "Collaborative, cross-disciplinary teamwork (researchers, engineers, traders working together)",
    "Teaching, mentorship and investment in newcomer development",
    "Intellectual curiosity and continuous learning",
    "Open-mindedness to multiple modeling approaches",
    "Practical focus on translating research into actionable trading outcomes",
    "Precision in communication and admitting/learning from mistakes"
  ],
  "tailoring_recommendations": [
    "Lead with Python and ML expertise on your CV; list concrete projects using time series, feature engineering, and model building.",
    "Highlight experience with large-scale data, HPC/GPU usage, distributed training, and any tooling you used (name frameworks and cluster sizes if possible).",
    "If you have a PhD or research publications, put them prominently; describe research methods and experimental design.",
    "Show collaboration examples: working with engineers/traders, mentoring juniors, or cross-functional projects.",
    "Quantify impact: include metrics (e.g., model performance improvements, latency, data volumes, cores/GPUs used, production outcomes).",
    "Include relevant ATS keywords from the job description naturally in role summaries and skills section.",
    "Provide links to code/repos, papers, or runnable demos that demonstrate your modeling and engineering ability.",
    "Emphasize curiosity and learning: brief examples where you learned a new technique, admitted mistakes, and iterated to improvement."
  ]
}