{"job_title":"Product Analyst","company_name":"MTS","industry":"Financial Services — Fixed Income / Electronic Trading","location":"London, UK (MTS London office)","essential_requirements":["Detail-oriented with strong attention to accuracy","Highly organised and process-driven","Excellent follow-through and delivery focus","Confident communicator able to coordinate between clients and internal teams","Genuine interest in fixed income markets, electronic trading and regulation","Ability to collate business requirements and draft change requests","Ability to support testing and release of product updates","Capability to prepare succinct research summaries and presentations"],"preferred_requirements":["Prior experience in product development","Prior experience or familiarity with financial regulation","Experience working with sales, marketing or client-facing teams","Experience using generative AI tools to consume documentation and produce research","Experience representing a business at industry forums or conferences","Experience with data analysis to support product decisions"],"hard_skills":["Requirements gathering / business analysis","Drafting change requests and product specifications","User acceptance testing (UAT) / coordinating product releases","Data analysis of internal and external datasets","Creating client and internal presentations","Competitive and regulatory research","Working with technology teams to deliver system changes","Working with sales and marketing to produce client content","Familiarity with generative AI tools for research/summary","Proficiency in Excel and PowerPoint"],"soft_skills":["Attention to detail","Organisation and process orientation","Strong stakeholder management","Clear verbal and written communication","Client-facing confidence","Teamwork and collaboration","Prioritisation and follow-through","Adaptability to changing regulatory/product requirements"],"ATS_keywords":["Product Analyst","Product Development","Fixed Income","Electronic Trading","Regulatory","Requirements Gathering","Change Requests","User Acceptance Testing","UAT","Product Updates","Data Analysis","Presentations","Stakeholder Management","Sales Support","Marketing Collateral","Generative AI","MTS","London","Competitor Analysis","Technology Team"],"key_responsibilities":["Gather and collate business and regulatory requirements, draft change requests and maintain clear documentation.","Coordinate with internal technology teams and clients to test (UAT) and release product updates across MTS systems.","Perform research and data analysis (including use of generative AI where appropriate) to support product decisions and produce presentations for internal and external audiences."],"tools_and_technologies":["MTS internal technology systems","Generative AI tools (for document ingestion and summarisation)","Excel (data analysis)","PowerPoint (presentations)","CRM / ticketing / issue tracking tools (e.g., JIRA, ServiceNow - likely)","Internal/external datasets (market and regulatory data)","Collaboration tools (e.g., email, Slack/Teams, Confluence)"],"company_values":["Equal opportunity and non-discrimination","Diversity and inclusion","Mutual respect","Collaboration across teams","Client focus","Regulatory compliance and integrity"],"tailoring_recommendations":["Lead with relevant fixed income / electronic trading interest or experience — mention markets, instruments or venues you've worked with.","Highlight any direct product development or regulatory project work (requirements, change requests, UAT) with concrete examples and outcomes.","Quantify data analysis work (e.g., datasets handled, impact on decisions, KPIs improved) and list tools used (Excel, SQL, Python if applicable).","Showcase stakeholder management and client-facing experience — reference cross-functional projects with technology, sales, or marketing.","Include examples of presentations created for clients or internal leadership and link to (or describe) conference/forum participation if applicable.","Mention experience or familiarity with generative AI tools and how you used them to summarise documentation or speed research.","Use ATS keywords from the job (e.g., 'Product Development', 'Fixed Income', 'Requirements Gathering', 'Change Requests', 'UAT').","State availability/location (London) and willingness to represent the firm at industry events.","Keep descriptions concise and results-focused; tailor your professional summary to mirror the role’s combination of product, regulatory and client-facing responsibilities."]}