{"profile":"Aspiring Quantitative Researcher skilled in Python, numerical simulation and machine learning, with practical experience in time series analysis, feature engineering and experiment design. Collaborative problem-solver who translates models into actionable results; seeking a Quant role at Jane Street.","education":[{"degree":"MPhys Physics","institution":"University of Warwick","location":"UK","start_date":"October 2022","end_date":"July 2026","grade":"First (expected)","description":["Strong performance across years: 85%, 89%, 82% in Years 1–3 respectively; relevant modules include scientific and high-performance computing, advanced mathematical methods and statistical physics.","Investigated metastability of nucleation in the 2D Ising model using dozens of Monte Carlo simulations in MATLAB; co-authored a paper with two peers within three weeks.","Numerically solved partial differential equations in C using finite-difference methods to model industrial heat flow; achieved 95% on the task.","Ran over 10,000 N-body simulations using a Python integrator, applying MEGNO for orbital stability quantification and advanced post-processing to interpret results.","Co-developed a PID stabilisation algorithm in LabVIEW for a nodding-donkey system, improving stability and adding angle-control features."]},{"degree":"A-levels","institution":"Forest School","location":"UK","start_date":"September 2020","end_date":"July 2022","grade":"A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)","description":["Sixth-form valedictorian for academic performance.","5000-word Extended Project on mitigation of climate change (renewables, nuclear, geoengineering), awarded 100%.","Presented project findings to 160+ students and staff, demonstrating clear and precise public communication."]}],"work_experience":[{"title":"Undergraduate Researcher","company":"Warwick Mathematics Institute","location":"Coventry, UK","start_date":"June 2025","end_date":"October 2025","description":["Modelled finite-difference methods for wave propagation across 100+ aeroacoustics simulations, implementing and validating numerical schemes.","Designed and ran simulation experiments to compare 10 maximal-order and dispersion-relation-preserving schemes in MATLAB, optimising for accuracy versus computational cost.","Analysed time-series outputs and produced concise visualisations and a 2-page poster summarising methods and results for a departmental event."]},{"title":"Project Manager","company":"Warwick Aerospace Society","location":"Coventry, UK","start_date":"January 2024","end_date":"March 2025","description":["Led a 12-member student team developing a proof-of-concept UHF satellite ground station; scheduled and chaired weekly meetings and coordinated four specialised sub-teams.","Authored 30+ pages of technical documentation and bills of materials, applying structured experiment design and selection matrices for antenna choice.","Initiated MATLAB/Simulink modelling of rotator-control and implemented GitHub-based version control for collaborative development."]},{"title":"RF Seekers Summer Intern","company":"MBDA UK","location":"Stevenage, UK","start_date":"June 2024","end_date":"August 2024","description":["10-week placement in the Modelling and Algorithms team working on SAR range–Doppler processing chains for AESA radar systems.","Optimised a matched-filter algorithm in MATLAB using FFT methods, reducing runtime by 85% and improving end-to-end processing performance.","Co-developed a data-analysis application used by six colleagues to inspect range–Doppler images, integrating a mid-fidelity algorithm for rapid sanity checks.","Delivered 50+ commits using professional development practices and version control; researched literature to inform algorithmic choices and validation."]},{"title":"Academic Coordinator","company":"Warwick Physics Society","location":"Coventry, UK","start_date":"March 2024","end_date":"March 2025","description":["Delivered seven revision lectures and ran weekly academic support sessions for peers, explaining complex concepts clearly and receiving excellent feedback.","Organised a departmental 10-year anniversary talk attended by 100+ students and academics (guest: Prof Dame Athene Donald).","Coordinated teaching materials and schedules to support cohort performance in end-of-year assessments."]}],"projects":[{"title":"AI CV Generator","start_date":"July 2025","end_date":"ongoing","description":["Developed a CV and cover-letter generator in Python using OpenAI's API, producing structured JSON outputs and templated Word documents via docxtpl.","Ensured reproducible schemas with Pydantic BaseModel and implemented two SQL databases to track applications and pipeline state.","Optimised pipelines for ATS compatibility; achieved >50% on three ATS-checker sites and contributed to two job offers after 200 applications.","Applied software engineering practices: modular code, version control and basic experiment tracking for iterative model improvements."]}],"skills":{"languages":["Python","MATLAB","C","SQL","JSON","HTML/CSS/JavaScript"],"libraries":["NumPy","SciPy","Matplotlib","Pydantic","openAI"],"tools":["Git / GitHub","Simulink","LabVIEW","MATLAB toolboxes","Version control and reproducible pipelines"],"soft_skills":["Analytical and quantitative thinking","Collaborative teamwork and cross-functional communication","Clear and precise written/verbal communication","Intellectual curiosity and continuous learning","Project leadership and documentation"],"interests":["Machine learning","Time series analysis","Feature engineering","Amateur radio","Debating"]}}