{
  "title": "Graduate Digital Solution Engineer 2025",
  "company": "Mitsubishi Power",
  "deadline": "18/08/2025",
  "description": "Join us as a Graduate Digital Solution Engineer and contribute to the design, development, and deployment of cutting-edge digital solutions—including generative AI applications—supporting the availability, reliability, safety, and cybersecurity of power generation systems across the EMEA region.\nWorking as part of our multi-disciplinary Engineering Team, you’ll gain hands-on experience with the TOMONI platform and other Mitsubishi digital tools while supporting real-world operations involving gas turbines, steam turbines, and generators. You’ll play a key role in creating technical solutions, supporting sales efforts, developing technical documentation, and travelling to client sites for on-site implementation and troubleshooting.\nKey responsibilities\nSupport the implementation and ongoing maintenance of the TOMONI digital platform across customer sites.\nParticipate in the design and development of generative AI applications for internal and external use.\nTroubleshoot technical issues in collaboration with the Digital Solutions team, including software, hardware, and cybersecurity-related challenges.\nPrepare technical reports, procedures, and documents under the direction of the Engineering Manager.\nAssist in sales support by preparing technical documentation and responding to RFQs and purchase orders.\nTravel to customer sites for digital solution deployment, demonstrations, and technical support.\nParticipate in testing, setup, and in-house validation of digital solutions.\nCollaborate cross-functionally with teams to support digital transformation initiatives.\nWho we’re looking for\nEssential requirements\nBachelor’s degree in a STEM field (e.g., Computer Science, Engineering, Data Science, Applied Mathematics).\nBasic programming experience (academic or personal projects).\nFoundational knowledge of statistics and machine learning.\nProficient in Microsoft Office and digital tools like Excel and Power BI.\nBasic understanding of generative AI tools (e.g., ChatGPT).\nStrong analytical, problem-solving, and communication skills.\nAbility to work both independently and in a team.\nDesirable skills\nInterest in industrial digital solutions (predictive maintenance, IoT, cloud-based systems).\nBasic understanding of gas/steam turbines or mechanical engineering concepts.\nFamiliarity with IT & OT systems, TCP/IP networking, and cloud platforms (e.g., Microsoft Azure).\nExperience with data visualisation tools (Power BI, Tableau, Python libraries).\nExposure to AI agents, digital assistants, or workflow automation tools.\nBasic cybersecurity knowledge.\nJapanese language skills (optional but advantageous).\nPersonal attributes\nA proactive learner with a passion for technology and real-world applications.\nWillingness to be guided by senior engineers and managers.\nAdaptability, curiosity, and a solution-oriented mindset.\nAbout us\nMitsubishi Power headquartered in Yokohama, Japan, is a global leading company in the field of thermal power and environmental technologies. We can handle the entire production process from the development, design, manufacturing, construction and commissioning to after-sales service for thermal power plants.\nThe company has a total of 66 subsidiaries across 17 countries and was established as a joint venture in February 2014, bringing together the thermal power divisions of Mitsubishi Heavy Industries Ltd. and Hitachi Ltd.. Mitsubishi Power employs 18,300 staff worldwide and provides solutions for the improvement of operating thermal power generators using the latest digital technology.\nMitsubishi Power Europe is a 100% subsidiary of Mitsubishi Power. As a leading global company in the field of thermal power generation systems and environmental technology, we will continue to meet the expectations of our clients based worldwide in order to contribute to the future of a sustainable society.",
  "essential_requirements": [
    "Bachelor’s degree in a STEM field (Computer Science, Engineering, Data Science, Applied Mathematics or similar)",
    "Basic programming experience (academic or personal projects)",
    "Foundational knowledge of statistics and machine learning",
    "Proficiency in Microsoft Office (Excel) and digital tools (Power BI)",
    "Basic understanding of generative AI tools (e.g., ChatGPT)",
    "Strong analytical and problem‑solving skills",
    "Good written and verbal communication skills",
    "Ability to work independently and within a team",
    "Willingness to travel to customer sites"
  ],
  "preferred_requirements": [
    "Interest/experience in industrial digital solutions (predictive maintenance, IoT)",
    "Basic understanding of gas/steam turbines or mechanical engineering concepts",
    "Familiarity with IT & OT systems and TCP/IP networking",
    "Experience with cloud platforms (e.g., Microsoft Azure)",
    "Experience with data visualisation tools (Power BI, Tableau, Python libraries)",
    "Exposure to AI agents, digital assistants, or workflow automation tools",
    "Basic cybersecurity knowledge",
    "Japanese language skills (optional, advantageous)"
  ],
  "hard_skills": [
    "Programming (Python or similar)",
    "Foundational machine learning and statistics",
    "Data visualisation (Power BI, Tableau, Python viz libraries)",
    "Microsoft Excel (advanced usage)",
    "Familiarity with cloud platforms (Microsoft Azure)",
    "IT/OT basics and TCP/IP networking",
    "Basic cybersecurity awareness",
    "Technical documentation and report writing",
    "Troubleshooting hardware/software integrations",
    "Experience with generative AI tools and prompt engineering"
  ],
  "soft_skills": [
    "Analytical thinking",
    "Problem solving",
    "Clear written and verbal communication",
    "Team collaboration",
    "Ability to work independently",
    "Proactive learner / curiosity",
    "Adaptability and flexibility",
    "Solution-oriented mindset",
    "Willingness to be mentored and take direction",
    "Customer-facing skills (on-site support, demonstrations)"
  ],
  "ATS_keywords": [
    "Graduate Digital Solution Engineer",
    "TOMONI",
    "generative AI",
    "ChatGPT",
    "predictive maintenance",
    "IoT",
    "cloud",
    "Microsoft Azure",
    "Power BI",
    "Tableau",
    "Python",
    "machine learning",
    "statistics",
    "data visualisation",
    "cybersecurity",
    "IT/OT",
    "TCP/IP",
    "gas turbines",
    "steam turbines",
    "generators",
    "digital transformation",
    "on-site implementation",
    "troubleshooting",
    "technical documentation",
    "RFQ",
    "sales support",
    "workflow automation",
    "AI agents",
    "digital assistants"
  ],
  "key_responsibilities": [
    "Support implementation, configuration and ongoing maintenance of the TOMONI digital platform across customer sites (including testing, setup and validation).",
    "Participate in the design and development of generative AI applications and other digital solutions, supporting internal/external use and validation.",
    "Provide on-site deployment, troubleshooting and customer support for digital solutions; prepare technical reports/procedures and assist sales with technical documentation and RFQ responses."
  ],
  "tools_and_technologies": [
    "TOMONI platform (Mitsubishi Power digital platform)",
    "Microsoft Office (Excel, Word, PowerPoint)",
    "Power BI",
    "Tableau",
    "Python and Python data/visualisation libraries (e.g., pandas, matplotlib, seaborn, plotly)",
    "Generative AI tools (e.g., ChatGPT) and AI agents/workflow automation tools",
    "Microsoft Azure (cloud services)",
    "IT/OT networking (TCP/IP)",
    "Basic cybersecurity tooling/concepts",
    "IoT sensors/platforms and industrial data interfaces"
  ],
  "company_values": [
    "Safety, reliability and availability of power generation systems",
    "Innovation and application of advanced digital technologies",
    "Customer focus and on-site support",
    "Global collaboration and cross-functional teamwork",
    "Sustainability and contribution to a sustainable society",
    "Continuous learning and technical excellence"
  ],
  "tailoring_recommendations": [
    "Lead with your STEM degree and highlight coursework or projects in statistics, machine learning, AI or data science.",
    "List programming projects (GitHub links if available) that show practical Python or ML experience—preferably projects involving time-series, predictive maintenance or IoT data.",
    "Demonstrate experience with Power BI / Tableau and Excel: mention dashboards built, KPIs visualised and any measurable outcomes.",
    "If you have cloud experience (Azure), describe services used (e.g., data storage, compute, model deployment) and scale.",
    "Include any exposure to OT/industrial systems, networking (TCP/IP) or mechanical/turbine-related coursework or internships.",
    "Describe any hands‑on experience with generative AI (ChatGPT prompts, prototypes, agents) and how you validated or integrated them.",
    "Highlight troubleshooting, on-site support, or customer-facing experience; emphasise willingness to travel and examples of field work.",
    "Add any cybersecurity fundamentals or certifications (even basic) to address security expectations.",
    "Use ATS keywords from the job description verbatim in your CV (TOMONI, generative AI, Power BI, Azure, predictive maintenance, IoT, gas/steam turbines, RFQ, on-site implementation).",
    "Quantify achievements where possible (e.g., reduced troubleshooting time by X%, improved model accuracy to Y%, delivered N dashboards).",
    "Show soft skills with short examples: team projects, times you learned new tech quickly, or problem‑solving outcomes under guidance.",
    "If applicable, mention language skills (Japanese) and global/cross-cultural experience to match the multinational context."
  ]
}