{
  "title": "Graduate Digital Solution Engineer 2025",
  "company": "Mitsubishi Power",
  "deadline": "18/08/2025",
  "description": "Join us as a Graduate Digital Solution Engineer and contribute to the design, development, and deployment of cutting-edge digital solutions—including generative AI applications—supporting the availability, reliability, safety, and cybersecurity of power generation systems across the EMEA region.\nWorking as part of our multi-disciplinary Engineering Team, you’ll gain hands-on experience with the TOMONI platform and other Mitsubishi digital tools while supporting real-world operations involving gas turbines, steam turbines, and generators. You’ll play a key role in creating technical solutions, supporting sales efforts, developing technical documentation, and travelling to client sites for on-site implementation and troubleshooting.\nKey responsibilities\nSupport the implementation and ongoing maintenance of the TOMONI digital platform across customer sites.\nParticipate in the design and development of generative AI applications for internal and external use.\nTroubleshoot technical issues in collaboration with the Digital Solutions team, including software, hardware, and cybersecurity-related challenges.\nPrepare technical reports, procedures, and documents under the direction of the Engineering Manager.\nAssist in sales support by preparing technical documentation and responding to RFQs and purchase orders.\nTravel to customer sites for digital solution deployment, demonstrations, and technical support.\nParticipate in testing, setup, and in-house validation of digital solutions.\nCollaborate cross-functionally with teams to support digital transformation initiatives.\nWho we’re looking for\nEssential requirements\nBachelor’s degree in a STEM field (e.g., Computer Science, Engineering, Data Science, Applied Mathematics).\nBasic programming experience (academic or personal projects).\nFoundational knowledge of statistics and machine learning.\nProficient in Microsoft Office and digital tools like Excel and Power BI.\nBasic understanding of generative AI tools (e.g., ChatGPT).\nStrong analytical, problem-solving, and communication skills.\nAbility to work both independently and in a team.\nDesirable skills\nInterest in industrial digital solutions (predictive maintenance, IoT, cloud-based systems).\nBasic understanding of gas/steam turbines or mechanical engineering concepts.\nFamiliarity with IT & OT systems, TCP/IP networking, and cloud platforms (e.g., Microsoft Azure).\nExperience with data visualisation tools (Power BI, Tableau, Python libraries).\nExposure to AI agents, digital assistants, or workflow automation tools.\nBasic cybersecurity knowledge.\nJapanese language skills (optional but advantageous).\nPersonal attributes\nA proactive learner with a passion for technology and real-world applications.\nWillingness to be guided by senior engineers and managers.\nAdaptability, curiosity, and a solution-oriented mindset.\nAbout us\nMitsubishi Power headquartered in Yokohama, Japan, is a global leading company in the field of thermal power and environmental technologies. We can handle the entire production process from the development, design, manufacturing, construction and commissioning to after-sales service for thermal power plants.\nThe company has a total of 66 subsidiaries across 17 countries and was established as a joint venture in February 2014, bringing together the thermal power divisions of Mitsubishi Heavy Industries Ltd. and Hitachi Ltd.. Mitsubishi Power employs 18,300 staff worldwide and provides solutions for the improvement of operating thermal power generators using the latest digital technology.\nMitsubishi Power Europe is a 100% subsidiary of Mitsubishi Power. As a leading global company in the field of thermal power generation systems and environmental technology, we will continue to meet the expectations of our clients based worldwide in order to contribute to the future of a sustainable society.",
  "essential_requirements": [
    "Bachelor’s degree in a STEM field (Computer Science, Engineering, Data Science, Applied Mathematics)",
    "Basic programming experience (academic or personal projects)",
    "Foundational knowledge of statistics and machine learning",
    "Proficiency with Microsoft Office and digital tools (Excel, Power BI)",
    "Basic understanding of generative AI tools (e.g., ChatGPT)",
    "Strong analytical and problem‑solving skills",
    "Good verbal and written communication skills",
    "Ability to work independently and in a team"
  ],
  "preferred_requirements": [
    "Interest or experience in industrial digital solutions (predictive maintenance, IoT, cloud‑based systems)",
    "Basic understanding of gas/steam turbines or mechanical engineering concepts",
    "Familiarity with IT & OT systems, TCP/IP networking",
    "Experience with cloud platforms (e.g., Microsoft Azure)",
    "Experience with data visualisation tools (Power BI, Tableau, Python libraries)",
    "Exposure to AI agents, digital assistants, or workflow automation tools",
    "Basic cybersecurity knowledge",
    "Japanese language skills (optional/advantageous)"
  ],
  "hard_skills": [
    "Programming (Python or similar)",
    "Statistics and basic machine learning",
    "Data visualisation (Power BI, Tableau, Python libraries)",
    "Use of Microsoft Office (Excel, Word, PowerPoint)",
    "Familiarity with generative AI tools and LLMs",
    "Basic cloud platform experience (Microsoft Azure)",
    "Understanding of IT/OT and TCP/IP networking",
    "Technical troubleshooting of software/hardware/cybersecurity issues",
    "Technical documentation and reporting",
    "Working with industrial digital platforms (TOMONI or similar)"
  ],
  "soft_skills": [
    "Analytical thinking",
    "Problem‑solving",
    "Clear written and verbal communication",
    "Teamwork and cross‑functional collaboration",
    "Ability to work independently",
    "Curiosity and adaptability",
    "Proactive learner / self‑starter",
    "Solution‑oriented mindset",
    "Willingness to take direction from senior engineers and managers",
    "Customer‑facing confidence (onsite support/demonstrations)"
  ],
  "ATS_keywords": [
    "Graduate Digital Solution Engineer",
    "TOMONI",
    "Mitsubishi Power",
    "generative AI",
    "ChatGPT",
    "predictive maintenance",
    "IoT",
    "cloud",
    "Microsoft Azure",
    "Power BI",
    "Tableau",
    "Python",
    "data visualisation",
    "machine learning",
    "statistics",
    "IT/OT",
    "TCP/IP",
    "cybersecurity",
    "gas turbine",
    "steam turbine",
    "generator",
    "digital transformation",
    "deployment",
    "troubleshooting",
    "RFQ",
    "technical documentation",
    "on‑site support"
  ],
  "key_responsibilities": [
    "Implement, configure and maintain the TOMONI digital platform and other Mitsubishi digital tools across customer sites, including testing and in‑house validation.",
    "Design and develop generative AI applications and other digital solutions; participate in data analysis, model/solution testing, documentation and integration workstreams.",
    "Provide technical and customer support: travel to client sites for deployment, demonstrations and troubleshooting; prepare technical reports, support sales (RFQs, purchase orders) and collaborate cross‑functionally."
  ],
  "tools_and_technologies": [
    "TOMONI digital platform",
    "Microsoft Office (Excel, Word, PowerPoint)",
    "Power BI",
    "Tableau",
    "Python and Python data/ML libraries (pandas, scikit‑learn, matplotlib etc.)",
    "Generative AI tools/LLMs (ChatGPT, AI agents, digital assistants)",
    "Cloud platforms (Microsoft Azure)",
    "IT & OT systems and TCP/IP networking tools",
    "Cybersecurity basics/tools",
    "Workflow automation tools and AI agents",
    "Gas/steam turbine and generator operational systems (domain hardware)"
  ],
  "company_values": [
    "Focus on sustainability and contributing to a sustainable society",
    "Global collaboration and presence",
    "Innovation and application of digital technologies",
    "Customer‑centric service and after‑sales support",
    "Reliability, safety and cybersecurity in power systems",
    "Continuous learning, mentorship and technical excellence"
  ],
  "tailoring_recommendations": [
    "Lead with your STEM degree and list relevant modules/projects in programming, statistics and ML.",
    "Highlight hands‑on projects or coursework using Python, Power BI/Tableau, Excel and any ML work; link to Github or portfolio if available.",
    "Mention any exposure to generative AI (ChatGPT/LLMs), automation or AI agents and describe specific use cases or prototypes.",
    "If you have cloud experience, note Azure projects or certifications (even basic).",
    "Call out any industrial, turbomachinery or mechanical engineering exposure, even academic lab work or internships.",
    "Include keywords from the JD (TOMONI, Mitsubishi Power, predictive maintenance, IoT, Azure, Power BI, Python, RFQ, cybersecurity, gas/steam turbine) in context — summary, skills and experience sections.",
    "Demonstrate customer‑facing and travel readiness (onsite deployments/demos/troubleshooting).",
    "Quantify impact where possible (e.g., reduced downtime, improved detection accuracy, time saved by automation).",
    "Show evidence of soft skills: teamwork, adaptability, proactive learning — e.g., mentoring, cross‑discipline projects or fast upskilling examples.",
    "If applicable, include basic Japanese ability and any relevant certifications (Azure fundamentals, security basics) to stand out."
  ]
}