{
  "title": "Graduate Building Physics Engineer September 2025",
  "company": "Method Consulting",
  "deadline": "rolling",
  "description": "Please note that we aim to review most applications within 2 weeks, however due to the volume of applications we receive for graduate applications, these can take up to 6 weeks. If you are selected for an interview, you will be contacted within this timeframe. \nStart Date: September 2025\nOffice: Swindon/ Bristol/ Cardiff (please specify 1st and 2nd choice of location on applying)\nWe will try our best to accommodate location preferences where possible but, in some cases, you may not be allocated your first or second choice location for your initial training period.\nMethod operates a hybrid working policy so this will be a blend of the office and working remotely.\nEmployment type: Permanent, Full Time\nAbout the role\nAre you passionate about sustainable building design and want to join a leading independent sustainability and engineering consultancy? \nWe are looking for a motivated and enthusiastic STEM graduate or experienced computer modeller (IES) who is keen to join our Building Physics department. You will be expected to develop dynamic 3D computer models of the proposed building and input and analyse data from the computer simulation software to meet various targets. An appreciation of thermodynamics, sustainable building design, and energy systems is essential.  \nBased at either our new modern head office in central Swindon which has good travel links to London, Bristol and Bath, or one of our other offices in Bristol or Cardiff, you will have the opportunity to expand your skillset and gain invaluable knowledge from other team members, whilst working closely with our other business groups.\nGraduate Training Programme\nOur Graduate programme last around 2-3 years however, this timescale is wholly dependent on the individual paths each person will take. The aim of the programme is to give all graduates a structured pathway for the start of their career.\nAll graduates at Method work on real live projects and learn on the job carrying out tasks for those projects – this programme gives you some insight into what to expect within those two years including the formalities of technical reviews, membership of professional institutions etc.\nTechnical and non technical education such as presentation skills and time management courses etc, will make up a significant part of the programme. Everyone’s training is individual and tailored to their strengths and weaknesses enabling you to reach your full potential and gain both reward and satisfaction.\nYou will also be encouraged to develop your qualifications and become affiliated with an accredited institution such as CIBSE, IMechE, IET or the Energy Institute.\nIncluded in Building Magazine’s Top 150 Consultants & Top 50 Engineers list for the past four  years, we have also been included in the Top 50 Employers in Building Magazine’s annual survey. \nWe are committed to providing the very best to our team and our workplace initiatives ensure that you will have the right resources and skills to achieve your goals.\nRole and responsibilities\nComputer modelling of buildings to assess energy use, thermal performance, and daylighting (using IES Rhino)\nCompleting projects for Part L compliance, CIBSE TM52/59, EPCs, CIBSE TM54, Passive House\nAdvising design teams and clients on how to reduce energy use through passive design, energy efficiency and renewable technologies\nAdvising design team and clients on how to improve the thermal comfort through building physics and passive design measures\nPerforming daylight and sunlight assessments, optimising natural lighting while managing glare\nAssessing proposed buildings utilising the PHPP (Passive House Planning Package) software\nWorking with design teams including architects, structural engineers, quantity surveyors and specialist consultants\nAdvising on building physics aspects and completing modelling required for BREEAM \nAdvising on building-integrated renewable energy\nSite visits to construction sites and existing buildings\nExperience and qualifications\nAn appreciation of thermodynamics and energy systems are essential\nYou should have a good degree in sustainable building design or architectural engineering\nYou must have a passion for sustainable building design and reducing the carbon emissions of the built environment\nYou must be interested in the built environment and have the ability to communicate clearly and professionally\nYou will need to adapt to new situations quickly and be willing to contribute as an active design team member\nKnowledge or awareness of BREEAM would be beneficial\nEducated to degree level in physical sciences or any engineering discipline – for example physics, mechanical or electrical engineering, building services engineering, environmental engineering, architectural engineering\nKnowledge of passive design, renewable energy systems and sustainable assessments such as BREEAM, WELL, Passive House\nExperience with using IES Virtual Environment software is essential\nExperience in coding (using programs such as Python), Revit and AUTOCAD is desirable, but not essential\nWe are unable to accept applications from anyone who requires sponsorship to live and work in the UK now or in the future.\nAt Method Consulting we offer a benefits package designed to provide an excellent work/life balance. We are absolutely committed to the development of our staff and offer wide-ranging opportunities for training and professional development. Our salaries are highly competitive and will increase rapidly with experience.",
  "essential_requirements": [
    "Degree-level education in physical sciences or engineering (e.g., sustainable building design, architectural engineering, physics, mechanical/electrical/building services/environmental engineering)",
    "Appreciation and understanding of thermodynamics and energy systems",
    "Experience using IES Virtual Environment (IES VE) for building simulation (essential)",
    "Passion for sustainable building design and reducing carbon emissions",
    "Ability to communicate clearly and professionally with design teams and clients",
    "Ability to adapt quickly and contribute as an active design team member",
    "Right to live and work in the UK without sponsorship",
    "Available to start September 2025 (Graduate role) and able to work full-time, permanent",
    "Willingness to undertake site visits to construction sites and existing buildings"
  ],
  "preferred_requirements": [
    "Knowledge or awareness of BREEAM",
    "Experience with PHPP (Passive House Planning Package)",
    "Experience with compliance and assessment frameworks: Part L, CIBSE TM52/TM59, CIBSE TM54, EPCs, Passive House",
    "Experience or familiarity with coding (Python)",
    "Experience with Revit and AutoCAD",
    "Knowledge of passive design, renewable energy systems and sustainable assessment frameworks (WELL, Passive House)",
    "Interest in and willingness to pursue professional institution membership (CIBSE, IMechE, IET, Energy Institute)",
    "Experience or interest in daylight and sunlight assessment tools"
  ],
  "hard_skills": [
    "Building performance modelling and dynamic 3D simulation",
    "IES Virtual Environment (including IES Rhino workflows)",
    "Energy modelling for Part L compliance and EPC production",
    "Daylighting and sunlight analysis",
    "Thermal comfort and building physics analysis",
    "PHPP (Passive House Planning Package) use",
    "Knowledge of CIBSE guidance (TM52, TM59, TM54)",
    "BREEAM assessment modelling inputs",
    "Renewable energy systems analysis (building-integrated renewables)",
    "Technical report writing and compliance documentation",
    "Use of modelling/CAD/BIM tools (Revit, AutoCAD)",
    "Scripting/coding for automation or analysis (Python desirable)",
    "Site survey and on-site data collection"
  ],
  "soft_skills": [
    "Clear professional communication (written and verbal)",
    "Teamwork and collaborative design team working",
    "Adaptability and quick learning",
    "Problem solving and analytical thinking",
    "Enthusiasm and commitment to sustainability",
    "Time management and organisation",
    "Presentation skills and client-facing advisory capability",
    "Attention to detail for technical reviews and compliance"
  ],
  "ATS_keywords": [
    "IES Virtual Environment",
    "IES Rhino",
    "building physics",
    "building simulation",
    "dynamic 3D modelling",
    "energy modelling",
    "thermodynamics",
    "sustainable building design",
    "Part L",
    "CIBSE TM52",
    "CIBSE TM59",
    "CIBSE TM54",
    "EPC",
    "Passive House",
    "PHPP",
    "BREEAM",
    "WELL",
    "daylighting",
    "sunlight assessment",
    "renewable energy",
    "Revit",
    "AutoCAD",
    "Python",
    "site visits",
    "graduate programme",
    "building-integrated renewables",
    "energy systems",
    "thermal comfort",
    "compliance"
  ],
  "key_responsibilities": [
    "Create and run dynamic 3D building models and simulations (IES VE / IES Rhino) to assess energy use, thermal performance and daylighting for design and compliance purposes.",
    "Produce compliance and assessment outputs (Part L, EPCs, CIBSE TM52/TM59/TM54, PHPP/Passive House inputs, BREEAM modelling) and technical reports; advise design teams to meet targets.",
    "Advise and collaborate with architects, engineers and clients on passive design, energy efficiency, thermal comfort and building-integrated renewable solutions; perform site visits as required."
  ],
  "tools_and_technologies": [
    "IES Virtual Environment (IES VE)",
    "IES Rhino (Rhino / Grasshopper integration if applicable)",
    "PHPP (Passive House Planning Package)",
    "Revit",
    "AutoCAD",
    "Python (scripting/coding)",
    "BREEAM assessment tools/inputs",
    "CIBSE guidance documents (TM52, TM59, TM54)",
    "EPC generation tools/software",
    "Standard office tools for reporting and presentations (MS Office/PowerPoint)"
  ],
  "company_values": [
    "Commitment to sustainable building design and reducing carbon emissions",
    "Professional development and structured graduate training",
    "Investment in staff training and career progression",
    "Collaboration and multi-disciplinary working",
    "Quality and technical excellence (recognised in industry rankings)",
    "Work/life balance and employee wellbeing",
    "Client-focused advisory and practical, real-project experience"
  ],
  "tailoring_recommendations": [
    "Lead with your IES VE experience: describe specific projects, your modelling role, and quantifiable outcomes (e.g., % energy savings, improvements in daylighting, compliance achieved).",
    "Include exact software keywords (IES Virtual Environment, IES Rhino, PHPP, Revit, AutoCAD, Python) so ATS and recruiters can match skills quickly.",
    "Highlight degree subject and relevant modules or thesis work demonstrating thermodynamics, energy systems or building physics knowledge.",
    "Showcase compliance experience (Part L, EPCs, CIBSE TM52/TM59/TM54, Passive House/PHPP, BREEAM) even if involvement was partial—state specific tasks and deliverables.",
    "Give examples of multidisciplinary teamwork, client-facing advice, and site visits to demonstrate communication and practical experience.",
    "Mention membership aspirations or progress toward professional institutions (CIBSE, IMechE, IET, Energy Institute) if applicable.",
    "Confirm right to work in the UK and state preferred office locations (1st and 2nd choice) as requested in the application.",
    "If you lack IES experience but have transferable simulation skills, explain similarities, any self-directed IES training, and emphasize quick learning/adaptability.",
    "Quantify impact where possible (kWh savings, % reduction in heating/cooling loads, daylight metrics) and include links or brief portfolios of modelling outputs if allowed.",
    "Tailor your personal statement to emphasize passion for sustainability and alignment with the company’s training and development culture."
  ]
}