{"opening_paragraph":"I am excited to apply for the Macquarie Asset Management Graduate Programme 2026. Macquarie’s focus on delivering positive, long‑term outcomes across infrastructure and sustainable assets strongly resonates with my desire to apply rigorous quantitative analysis to real‑world problems. As an MPhys Physics student at the University of Warwick (expected First, July 2026) with hands‑on experience in large‑scale simulation, algorithm optimisation and technical project leadership, I am confident I can contribute immediately to investment research, transaction workstreams and client/risk support.","core_paragraphs":"My technical background maps directly to the analytical demands of Macquarie Asset Management. At MBDA I interned in the Modelling and Algorithms team, where I implemented an FFT‑based optimisation in MATLAB that reduced a matched‑filter algorithm’s runtime by 85% and integrated mid‑fidelity checks into a post‑processing application used by six colleagues. At Warwick I ran over 10,000 N‑body and Monte Carlo simulations, developed finite‑difference PDE solvers in C and MATLAB, and analysed numerical schemes for aeroacoustics research; these experiences demonstrate the data analysis, numerical modelling and attention to computational efficiency that underpin robust investment and asset due diligence. I regularly communicate technical results: I produced detailed technical documentation (30+ pages) and posters, presented internship outcomes to 20+ colleagues, and delivered revision lectures and department talks to audiences of ~100, preparing clear materials in PowerPoint and written reports.\n\nAlongside technical skills (Python, MATLAB, C, SQL, Git, Microsoft Office) I bring proven teamwork, project management and initiative. As Project Manager for the Warwick Aerospace Society I led a 12‑member team, coordinated weekly meetings and supplier procurement to deliver a proof‑of‑concept UHF ground station on schedule. I have a track record of rapid up‑skilling—researching AESA radar literature during my placement and attending an ESA CubeSat workshop—and of building tools to improve workflows (eg. a Python/SQL CV‑tracking application that automated application tracking and produced ATS‑friendly documents). These experiences match Macquarie’s emphasis on collaborative problem‑solving, adaptability and contributing ideas to improve processes.","closing_paragraph":"I am enthusiastic about joining Macquarie to develop investment and risk skills on the job, contribute to teams managing critical infrastructure assets, and give back through the Graduate Volunteer Network. Thank you for considering my application; I would welcome the opportunity to discuss how my quantitative background and collaborative experience can support Macquarie Asset Management’s goals."}