{"profile":"MPhys Physics (University of Warwick), expected July 2026. Available for a 12-month Graduate Programme. Analytical physicist with strong data analysis, numerical modelling and presentation skills seeking a graduate role in Macquarie Asset Management, with interest in infrastructure, renewable energy, transactions and risk-aware investment solutions.","education":[{"degree":"MPhys Physics","institution":"University of Warwick","location":"UK","start_date":"October 2022","end_date":"July 2026","grade":"First (expected)","description":["Relevant modules: scientific and high-performance computing, advanced mathematical methods, fluid mechanics, electromagnetism and statistical physics.","Conducted Monte Carlo and N-body simulations (10,000+ runs) and used MEGNO for orbital stability analysis; implemented post-processing in Python for quantitative interpretation.","Numerically solved partial differential equations in C using finite difference methods to model industrial heat flow; modelled and validated control algorithms (PID) in LabVIEW for mechanical stabilisation systems."]},{"degree":"A-levels","institution":"Forest School","location":"UK","start_date":"September 2020","end_date":"July 2022","grade":"A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)","description":["Extended Project (5,000 words) assessing renewable energy, nuclear power and geoengineering to mitigate climate change — awarded 100%.","Received sixth form valedictorian award for academic performance.","Presented research findings to a cohort of 160+ students and staff, demonstrating clear communication and public speaking."]}],"work_experience":[{"title":"Undergraduate Researcher","company":"Warwick Mathematics Institute","location":"Coventry, UK","start_date":"June 2025","end_date":"October 2025","description":["Modelled finite difference methods for wave propagation across 100+ aeroacoustic simulations, analysing trade-offs between accuracy and computational cost.","Benchmarked 10 maximal-order and dispersion-relation-preserving schemes in MATLAB, informing model selection and parameter choices.","Prepared a concise poster for a research event and presented findings to academic peers, refining technical communication and visualisation skills."]},{"title":"Project Manager","company":"Warwick Aerospace Society","location":"Coventry, UK","start_date":"January 2024","end_date":"March 2025","description":["Led a 12-member team to design and build a proof-of-concept UHF satellite ground station, coordinating sub-teams for electronics, mechanical, software and testing.","Organised 30+ weekly meetings, delegated work, provided weekly reports to senior leadership and managed procurement to deliver the prototype within 10 weeks.","Authored 30+ pages of technical documentation including bill of materials and selection matrices, strengthening stakeholder reporting and project governance.","Introduced GitHub-based version control and MATLAB/Simulink modelling to standardise development and reproducibility."]},{"title":"Academic Coordinator","company":"Warwick Physics Society","location":"Coventry, UK","start_date":"March 2024","end_date":"March 2025","description":["Delivered seven revision lectures and ran weekly academic support sessions, improving student preparedness for examinations.","Organised a departmental 10-year anniversary talk attended by 100+ students and academics, liaising with senior speakers and event stakeholders.","Explained complex technical concepts to large audiences, refining clarity in presentations and stakeholder engagement."]},{"title":"RF Seekers Summer Intern","company":"MBDA UK","location":"Stevenage, UK","start_date":"June 2024","end_date":"August 2024","description":["Ten-week placement in the Modelling and Algorithms team working on synthetic aperture radar (SAR) processing within AESA radar systems.","Optimised a matched-filter algorithm by implementing FFT methods, reducing runtime by 85% and improving processing throughput.","Co-developed a data-analysis application enabling six colleagues to rapidly review range–Doppler imagery; delivered 50+ commits using professional version control.","Presented technical outcomes to 20+ colleagues, producing clear slides and supporting documentation for non-specialist stakeholders."]}],"projects":[{"title":"AI CV Generator","start_date":"July 2025","end_date":"ongoing","description":["Developed a CV and cover-letter generator using OpenAI's API in Python, producing structured JSON outputs for templating.","Used Pydantic for schema validation and docxtpl to generate formatted Word documents; implemented two SQL databases to track applications and outcomes.","Achieved >50% on three ATS-checker sites and supported two successful job offers after iterative testing across ~200 applications, demonstrating measurable impact on application processes.","Prepared user-facing documentation and summary reports to communicate results and deployment steps to collaborators."]}],"skills":{"languages":["Python","MATLAB","C","SQL","Simulink","JSON","HTML","CSS","JavaScript"],"libraries":["NumPy","SciPy","Matplotlib","SQLite","pydantic"],"tools":["Microsoft Excel","Microsoft PowerPoint","Microsoft Word","Git","GitHub","LabVIEW","Origin Pro"],"soft_skills":["Analytical thinking","Data analysis and quantitative reasoning","Teamwork and stakeholder collaboration","Communication and presentation","Problem-solving and initiative"],"interests":["Sustainability and renewable energy","Infrastructure and space systems","Machine learning","Amateur radio"]}}