{"profile":"Upcoming Physics graduate and aspiring Improvement Analyst with project delivery and analytical experience in technical teams. Skilled in project management, business analysis, documentation and control reporting. Seeking to apply agile facilitation and process‑improvement skills within ScottishPower’s utilities and renewables programmes.","education":[{"degree":"MPhys Physics","institution":"University of Warwick","location":"UK","start_date":"October 2022","end_date":"July 2026","grade":"First (expected)","description":["Strong technical and numerical background: modules in high‑performance computing, fluid mechanics, electromagnetism and statistical physics.","Built and ran 10,000+ simulations (N‑body integrator, Python) and implemented data analysis techniques (MEGNO) to quantify stability; applied numerical methods (C, finite differences) to industrial heat‑flow modelling.","Led two 6‑person research projects on photovoltaic materials, scheduling and chairing weekly meetings, delegating tasks and delivering >70% outcomes; authored technical reports and posters."]},{"degree":"A-levels","institution":"Forest School","location":"UK","start_date":"September 2020","end_date":"July 2022","grade":"A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)","description":["Extended Project (5,000 words) on renewables, nuclear and geoengineering: achieved 100% — demonstrates interest in Net Zero and energy transition.","Sixth form valedictorian for academic performance.","Presented research to cohorts of 160+ students and staff, evidencing clear verbal communication and stakeholder engagement."]}],"work_experience":[{"title":"Undergraduate Researcher","company":"Warwick Mathematics Institute","location":"Coventry, UK","start_date":"June 2025","end_date":"October 2025","description":["Modelled finite‑difference schemes for wave propagation across 100+ aeroacoustic simulations, using MATLAB to test, validate and compare numerical approaches.","Analysed performance of 10 maximal‑order and dispersion‑preserving schemes, identifying stability and accuracy trade‑offs and recommending optimisations to reduce numerical error.","Produced research poster and technical documentation to present findings to academic stakeholders, supporting peer review and reproducibility."]},{"title":"Project Manager","company":"Warwick Aerospace Society","location":"Coventry, UK","start_date":"January 2024","end_date":"March 2025","description":["Managed a 12‑member team to deliver a proof‑of‑concept UHF satellite ground station within 10 weeks, coordinating design, procurement and integration activities.","Facilitated 30+ weekly team meetings, set priorities, defined roles and used GitHub for version control — improving delivery transparency and change traceability.","Authored 30+ pages of technical documentation and a bill of materials, creating repeatable standards and templates for future teams and supporting handover."]},{"title":"Fly Your Satellite Workshop (Participant)","company":"European Space Agency","location":"Noordwijk, Netherlands","start_date":"November 2024","end_date":"November 2024","description":["Completed a 5‑day ESA workshop on CubeSat systems engineering and requirements practices, attending 20 technical lectures on systems, communications and verification.","Collaborated in a 10‑person team to run a time‑boxed design sprint (60 minutes) meeting mission requirements under pressure — experience in rapid requirements capture and sprint delivery.","Gained practical insight into testing, systems integration and stakeholder briefings from ESTEC experts, strengthening agile delivery and verification skills."]},{"title":"RF Seekers Summer Intern","company":"MBDA UK","location":"Stevenage, UK","start_date":"June 2024","end_date":"August 2024","description":["10‑week placement in Modelling and Algorithms team working on synthetic aperture radar (SAR) processing chains and algorithm integration.","Optimised a matched‑filter algorithm in MATLAB using FFT techniques, reducing runtime by 85% and improving downstream processing throughput.","Co‑developed a data‑analysis application used by six colleagues for rapid sanity checks and post‑campaign analysis; practised version control and professional software development workflows."]}],"projects":[{"title":"AI CV Generator","start_date":"July 2025","end_date":"ongoing","description":["Developed an automated CV and cover‑letter generator using OpenAI API and Python, producing structured JSON outputs with Pydantic and generating Word documents via docxtpl.","Built SQL databases to track applications and outcomes, enabling basic control reporting and metrics tracking for continuous improvement.","Validated outputs against ATS‑checkers (scores >50%) and iterated templates to improve match rates; tool contributed to two job offers after ~200 applications."]}],"skills":{"languages":["Python","MATLAB","C","SQL","JSON","HTML/CSS/JavaScript"],"libraries":["NumPy","SciPy","Matplotlib","pydantic"],"tools":["Git / GitHub","Microsoft Office (Excel, Word, PowerPoint)","Simulink","LabVIEW","docxtpl"],"soft_skills":["Analytical and problem‑solving","Stakeholder communication","Team leadership and supervision","Facilitation of time‑boxed sprints and stand‑up style meetings","Attention to detail, documentation and control reporting"],"interests":["Renewable energy and Net Zero","Systems engineering","Amateur radio"]}}