{"job_title":"Improvement Analyst","company_name":"ScottishPower (Iberdrola Group)","industry":"Utilities / Energy (Renewables)","location":"Not specified (ScottishPower, UK)","essential_requirements":["Experience in the utilities or energy industry","Experience with change and incident management processes (particularly SAP and cloud-based application platforms)","Project delivery experience","Business analysis qualification or demonstrable business analysis experience","Project management qualification or demonstrable project management experience","Knowledge of agile methodologies and proven experience delivering projects using agile practices","Strong communication skills","Ability to produce and use control reporting and analysis to identify issues","Experience developing business cases and managing solutions through to implementation","Experience supporting audits and ensuring compliance with controls"],"preferred_requirements":["Experience identifying and applying SAP best practices (SAP change management)","Experience supervising and directing staff and external contractors/consultants","Experience with stakeholder management across business and IT","Experience designing, specifying, testing and implementing business process changes","Experience defining and rolling out standards, templates and maintaining documentation","Previous experience in a Centre of Excellence or shared-services environment","Familiarity with utilities-specific regulatory or compliance frameworks"],"hard_skills":["SAP change management (and SAP best practices)","Cloud-based application platform familiarity","Change and incident management","Business analysis (requirements elicitation, business cases)","Project management (planning, delivery, control)","Agile delivery (facilitating stand-ups, sprint planning, retrospectives, reviews)","Control reporting and root-cause analysis","Process design, specification, testing and implementation","Documentation and template creation","Audit and compliance support"],"soft_skills":["Strong verbal and written communication","Stakeholder management","Coaching and team facilitation","Leadership and supervision","Analytical and problem-solving","Prioritisation and decision-making","Collaboration and influencing","Attention to detail (controls/compliance)"],"ATS_keywords":["Improvement Analyst","Change Management","Incident Management","SAP","Cloud","Agile","Scrum","Sprint Planning","Daily Stand-up","Retrospective","Business Analysis","Project Management","Business Case","Controls","Compliance","Audit","Process Improvement","Centre of Excellence","Stakeholder Management","Process Design","Testing","Implementation","Documentation","Coaching","ServiceNow","Jira","ScottishPower","Iberdrola","Utilities","Renewables","Net Zero"],"key_responsibilities":["Provide support and quality controls for Customer Business change and incident management processes (with emphasis on SAP and cloud platforms), including control reporting, issue identification and creation of change/incident records.","Implement CoE process improvements and coach/facilitate agile practices and ceremonies (daily stand-ups, sprint planning, retrospectives, reviews) while providing training to team members.","Manage business and IT demand: identify/prioritise requirements, develop business cases, project-manage recommended solutions through specification, testing and implementation, and maintain standards, templates and documentation while supporting audits and stakeholder relationships."],"tools_and_technologies":["SAP (change management / related modules)","Cloud platforms (AWS, Azure or equivalent — platform unspecified)","ServiceNow or similar ITSM/change & incident management tools","Jira/Confluence or equivalent Agile delivery tools","MS Office (Excel, Word, PowerPoint), Visio","Project management tools (MS Project, Azure DevOps, or similar)","Reporting/analytics tools (Power BI or equivalent)"],"company_values":["Commitment to renewable energy and Net Zero","Inclusion and diversity","Social purpose and community focus","Investment in internal talent and career development","Sustainability and environmental responsibility"],"tailoring_recommendations":["Lead with utilities/energy experience and any exposure to renewables or Net Zero programmes to align with ScottishPower priorities.","Explicitly call out SAP change management and cloud platform experience; name specific modules/tools where possible (e.g., SAP Change Management, Solution Manager).","Highlight agile delivery experience and list ceremonies you’ve facilitated (daily stand-ups, sprint planning, retrospectives, reviews) and tools used (Jira, Confluence, Azure DevOps).","Showcase project delivery examples with measurable outcomes (delivery timelines, cost savings, defect reduction, compliance improvements).","List business analysis and project management qualifications/certifications (e.g., CBAP, BCS BA, PMP, PRINCE2, CSM/PSM) and any audit/compliance involvement.","Demonstrate experience producing control reporting, raising/triaging change/incidents and supporting audits — include specifics on controls or frameworks used.","Include examples of supervising staff or contractors and stakeholder management (names/levels of stakeholders, scale of teams).","Use ATS keywords from the job description in your CV (Change Management, Incident Management, SAP, Agile, Business Analysis, Project Management, Controls, Compliance, Utilities).","Align a short personal statement or cover letter with company values: sustainability, inclusion, and commitment to renewable energy."]}