{"profile":"MPhys Physics (First expected). Right to work in the UK. Seeking Graduate Offshore Analyst role at Aquaterra Energy. Strong numerical-modelling and data-analysis skills with MATLAB and Python; experience in wave propagation, PDEs and simulation. Clear technical report writing and stakeholder communication.","education":[{"degree":"MPhys Physics","institution":"University of Warwick","location":"UK","start_date":"October 2022","end_date":"July 2026","grade":"First (expected)","description":["Consistent high performance: 85% (Year 1), 89% (Year 2), 82% (Year 3).","Relevant modules: fluid mechanics, scientific and high-performance computing, advanced mathematical methods, numerical methods for PDEs.","Modelled heat flow in industrial pipes using finite-difference methods in C (95% in assignment); practical experience in numerical discretisation and stability analysis.","Ran 10,000+ Monte Carlo simulations and applied MEGNO for orbital-stability analysis using Python, including post-processing and statistical interpretation.","Designed PID control and LabVIEW stabilisation algorithm for a nodding-donkey system; led implementation and testing (86%)."]},{"degree":"A-levels","institution":"Forest School","location":"UK","start_date":"September 2020","end_date":"July 2022","grade":"A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)","description":["Received sixth-form valedictorian award for best academic performance.","Extended Project (5000 words) on renewable energy, nuclear power and geoengineering (100%).","Presented research to a cohort of 160+ students and staff, demonstrating confident public speaking and technical communication."]}],"work_experience":[{"title":"Undergraduate Researcher","company":"Warwick Mathematics Institute","location":"Coventry, UK","start_date":"June 2025","end_date":"October 2025","description":["Modelled wave propagation using finite-difference schemes in MATLAB across 100+ aeroacoustics simulations, focusing on accuracy and numerical stability.","Analysed and compared 10 maximal-order and dispersion-relation-preserving schemes, optimising accuracy versus computational cost for large-scale simulations.","Prepared a concise technical poster and two-page summary communicating methods, results and implications for structural/wave-loading analyses."]},{"title":"Project Manager","company":"Warwick Aerospace Society","location":"Coventry, UK","start_date":"January 2024","end_date":"March 2025","description":["Led a 12-member team to design and build a UHF satellite ground-station proof-of-concept, coordinating schedules, procurement and test activities.","Authored 30+ pages of technical documentation and bill of materials; used Pugh matrices to support engineering decisions and risk assessments.","Initiated MATLAB/Simulink modelling for communications and rotator control; implemented GitHub version control and weekly reporting to senior leadership.","Organised and chaired weekly meetings, delegated tasks across four sub-teams and ensured delivery to tight deadlines."]},{"title":"RF Seekers Summer Intern (Modelling & Algorithms)","company":"MBDA UK","location":"Stevenage, UK","start_date":"June 2024","end_date":"August 2024","description":["Developed and optimised signal-processing algorithms in MATLAB; implemented FFT-based matched-filter reducing runtime by 85%, improving overall pipeline performance.","Co-developed a range–Doppler data-analysis application used by six colleagues to accelerate post-processing during field campaigns.","Integrated a mid-fidelity algorithm into the application for rapid sanity checks and validated performance against higher-fidelity approaches.","Followed professional software practices with 50+ commits, conducted literature reviews and presented a technical placement summary to 20+ colleagues."]}],"projects":[{"title":"AI CV Generator","start_date":"July 2025","end_date":"ongoing","description":["Built a CV and cover-letter generator using OpenAI API in Python, with Pydantic for structured JSON output and docxtpl for Word export.","Implemented automation and data tracking with two SQL databases to store applications and monitor outcomes.","Achieved ATS-checker scores above 50% on three platforms and contributed to two job offers after ~200 applications.","Demonstrated scripting for analysis and automation applicable to engineering workflows (Python, templating and data pipelines)."]},{"title":"Drinks Ordering Web App","start_date":"August 2018","end_date":"September 2018","description":["Developed an order-management web application handling 80+ orders over 6 hours, removing queues and improving event logistics.","Implemented Ajax for asynchronous order updates and a responsive front-end to inform users when orders were ready for collection.","Received positive feedback from event staff and two software engineers on implementation and user experience."]}],"skills":{"languages":["Python","MATLAB","Simulink","C","SQL","JavaScript","HTML","CSS"],"libraries":["NumPy","SciPy","Matplotlib","SQLite","pydantic","jinja"],"tools":["Microsoft Excel (data analysis, spreadsheets)","MS Word (technical report writing)","Git / GitHub (version control)","LabVIEW","Origin Pro","MATLAB toolboxes / Simulink","Experience with numerical methods for PDEs and understanding of finite-element concepts; willing to learn OrcaFlex, SHEAR7 and GRLWEAP"],"soft_skills":["Analytical and problem-solving mindset","Technical report writing and presentation","Stakeholder communication and client-facing clarity","Teamwork and leadership","Attention to detail and time management"],"interests":["Offshore energy and sustainability (renewables, CCS, hydrogen)","Fluid dynamics and structural analysis","Programming for analysis/automation","Amateur radio","Tennis","Chess"]}}