{
  "title": "Graduate Offshore Analyst 2025",
  "company": "Aquaterra Energy",
  "deadline": "05/09/2025",
  "description": "At Aquaterra Energy, we provide specialist engineering solutions and equipment to the global offshore energy industry. From drilling and field development to decommissioning, carbon capture and storage, renewables and hydrogen projects – we help clients drive efficient and sustainable offshore operations.\nWe are seeking a Graduate Offshore Analyst (or an Offshore Analyst with some relevant experience) to join our expanding team at our Norwich head office.\nThis role will involve\nCarrying out detailed analysis of offshore structures.\nData collection and building finite element (FE) models.\nPreparing reports and liaising with clients and colleagues across Aquaterra Energy.\nWorking on riser analysis projects using industry-recognised software such as OrcaFlex, SHEAR7 and GRLWEAP to simulate scenarios including:\nExtreme wave loading for strength and stability assessment.\nFatigue assessments across a range of sea states.\nVortex induced vibration (VIV) response.\nSoil loads for pile-driving assessment.\nAbout you\nA first- or second-class honours degree in engineering (civil, mechanical, offshore, structural, naval architecture) or similar in physical sciences (physics) or mathematics.\nUnderstanding of finite element (FE) analysis.\nStrong problem-solving skills, with an aptitude for calculations and data analysis.\nClear and confident communication skills, both written and verbal.\nProficiency in Excel and MS Word.\nThe right to work in the UK.\nDesirable skills and experience\nFamiliarity with analysis software such as OrcaFlex, Ansys or MathCad.\nKnowledge of fluid dynamics.\nIndustrial experience, summer placements or internships (ideally in Oil & Gas).\nMasters/PhD in engineering, physics, or mathematics.\nExperience with programming languages.\nWhat we offer\nAt Aquaterra Energy, we believe everyone contributes to our success, whether through client-facing roles or through the delivery of high-quality work internally.\nTo support your development and career, we provide:\nPrivate Health Insurance.\nMatching pension contribution.\nLife cover at 4x basic salary.\n25 days annual leave + bank holidays (with option to purchase more).\nTraining, development and CPD support.\nReduced gym membership.\nEmployee assistance programme.\nFunded sports, social and charity events.\nCycle-to-work scheme.\nElectric car scheme.\nRetail benefit scheme.\nAs an equal opportunity employer, we welcome applications from all suitably qualified persons regardless of their sex, religion, race, age, sexual orientation, marital status, gender reassignment, pregnancy or maternity status, disability or neurodivergent status. Our people are valued, respected and encouraged to be their unique selves. We are committed to creating an environment where everyone has an equal opportunity to reach their potential, to be heard, included and to inspire great new ideas, to help Aquaterra Energy build a fantastic place to work. We are committed to accelerating our efforts supporting inclusion and diversity in our workplaces and communities to drive change.",
  "essential_requirements": [
    "First- or second-class honours degree in engineering (civil, mechanical, offshore, structural, naval architecture) or in physical sciences (physics) or mathematics",
    "Understanding of finite element (FE) analysis and experience building FE models",
    "Strong problem-solving skills with aptitude for calculations and data analysis",
    "Clear and confident written and verbal communication skills (report writing and client liaison)",
    "Proficiency in Excel and MS Word",
    "Right to work in the UK"
  ],
  "preferred_requirements": [
    "Familiarity with industry analysis software such as OrcaFlex, Ansys or MathCad",
    "Experience with riser analysis tools (SHEAR7, GRLWEAP) or similar",
    "Knowledge of fluid dynamics",
    "Industrial experience, summer placements or internships (ideally in Oil & Gas or offshore industry)",
    "Masters or PhD in engineering, physics or mathematics",
    "Experience with programming languages (e.g., Python, MATLAB or similar)"
  ],
  "hard_skills": [
    "Finite element (FE) modelling and structural analysis",
    "Riser analysis and simulation (extreme wave loading, fatigue, VIV)",
    "Fatigue assessment across sea states",
    "Vortex induced vibration (VIV) analysis",
    "Pile-driving and soil load assessment",
    "Use of OrcaFlex, SHEAR7, GRLWEAP and FEA packages (Ansys or equivalent)",
    "Data collection, processing and engineering calculations",
    "Technical report writing and documentation",
    "Proficiency with Excel (data analysis, spreadsheets) and MS Word",
    "Basic programming for analysis/automation (Python, MATLAB or similar)"
  ],
  "soft_skills": [
    "Analytical and problem-solving mindset",
    "Clear written and verbal communication",
    "Client-facing and stakeholder liaison",
    "Attention to detail and accuracy",
    "Teamwork and collaboration across disciplines",
    "Time management and ability to deliver to deadlines",
    "Willingness to learn and develop (CPD orientation)"
  ],
  "ATS_keywords": [
    "Graduate Offshore Analyst",
    "Offshore Analyst",
    "offshore structures",
    "finite element",
    "FE model",
    "FEA",
    "OrcaFlex",
    "SHEAR7",
    "GRLWEAP",
    "Ansys",
    "MathCad",
    "riser analysis",
    "fatigue assessment",
    "vortex induced vibration",
    "VIV",
    "wave loading",
    "soil loads",
    "pile-driving",
    "structural analysis",
    "data analysis",
    "report writing",
    "Excel",
    "MS Word",
    "fluid dynamics",
    "engineering degree",
    "civil engineering",
    "mechanical engineering",
    "naval architecture",
    "physics",
    "mathematics",
    "internship",
    "UK right to work",
    "programming",
    "Python",
    "MATLAB",
    "CPD"
  ],
  "key_responsibilities": [
    "Perform detailed structural analysis and finite element modelling of offshore equipment and structures, producing validated FE models and calculations.",
    "Conduct riser and dynamic simulations (using OrcaFlex, SHEAR7, GRLWEAP or equivalent) for extreme wave loading, fatigue assessments, VIV and soil/pile-driving loads.",
    "Prepare clear technical reports, present results and liaise with clients and multidisciplinary colleagues to support project delivery."
  ],
  "tools_and_technologies": [
    "OrcaFlex",
    "SHEAR7",
    "GRLWEAP",
    "Ansys (or other FEA packages)",
    "MathCad",
    "Excel (advanced spreadsheets, data analysis)",
    "MS Word",
    "Programming environments (e.g., Python, MATLAB)",
    "FE modelling tools and solvers",
    "Common office and collaboration tools (email, Teams/Slack, document management)"
  ],
  "company_values": [
    "Inclusion, diversity and equal opportunity",
    "Employee development and continuous professional development (CPD)",
    "Collaboration and respect across teams",
    "Delivering high-quality, client-focused engineering solutions",
    "Sustainability and support for energy transition (renewables, carbon capture, hydrogen)",
    "Wellbeing and employee support (benefits and work-life balance)"
  ],
  "tailoring_recommendations": [
    "Lead with a clear profile line: state your degree, classification, and 'Right to work in the UK' to immediately match essential criteria.",
    "List FE analysis and riser analysis tools prominently in a skills section (OrcaFlex, SHEAR7, GRLWEAP, Ansys, MathCad). Use exact product names to pass ATS checks.",
    "Give 2–3 concise project bullets showing FE model building, what you analysed (e.g., fatigue, VIV, wave loading), tools used, and quantifiable outcomes (e.g., % reduction in predicted stress, model validation against test data).",
    "Include any internships, placements or industrial projects and describe responsibilities and results; if no industry experience, highlight MSc/Undergrad project work demonstrating relevant analysis.",
    "Demonstrate Excel and report-writing experience: reference specific deliverables (technical reports, client presentations) and any templates/automation you built (macros, scripts).",
    "If you have programming experience, name languages and give brief examples of scripts or analysis automation (Python/MATLAB for post-processing or simulation automation).",
    "Mirror language from the JD in your CV and cover letter (e.g., 'finite element modelling', 'riser analysis', 'fatigue assessment', 'VIV') to improve ATS match.",
    "Keep formatting ATS-friendly: simple headings, keyword-rich skills section, avoid images/graphics and unusual fonts. Use job-relevant job titles where possible (e.g., 'Offshore Analyst Intern').",
    "Prepare an examples-based bullet for interviews describing a technical challenge, your analysis approach, tools used, results and client/stakeholder communication.",
    "Mention interest in offshore energy and sustainability (renewables, CCS, hydrogen) to align with company focus and values."
  ]
}