{"profile":"Aspiring Graduate Engineer seeking a position at Teledyne Microwave UK. MPhys Physics (First expected Jul 2026) with hands-on RF and electronic design experience from an MBDA AESA/SAR internship and UHF ground-station projects. Willing to relocate to Shipley and to undergo UK Security Clearance; committed to production support and design documentation.","education":[{"degree":"MPhys Physics","institution":"University of Warwick","location":"UK","start_date":"October 2022","end_date":"July 2026","grade":"First (expected)","description":["Relevant modules and skills: electromagnetism, scientific and high-performance computing, advanced mathematical methods; strong numerical methods and simulation experience.","Lab and coursework: developed a stabilisation algorithm in LabVIEW implementing PID control for a nodding-donkey system (86%), and designed, built and tested a DC voltage regulator using op-amps and MOSFETs.","Applied numerical methods: solved PDEs in C via finite-difference to model industrial heat flow (95%) and ran 10,000+ N-body simulations with MEGNO analysis for orbital stability.","Led two six-member research projects on photovoltaic materials and photocathodes; scheduled and chaired weekly meetings and ensured equitable task delegation (both 70%+)."]},{"degree":"A-levels","institution":"Forest School","location":"UK","start_date":"September 2020","end_date":"July 2022","grade":"A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)","description":["Extended Project (5000 words) on renewable energy, nuclear power and geoengineering, awarded 100%; developed research, technical writing and presentation skills.","Received sixth-form valedictorian award for academic performance; presented project findings to 160+ students and staff, demonstrating clear verbal communication.",""]}],"work_experience":[{"title":"Undergraduate Researcher","company":"Warwick Mathematics Institute","location":"Coventry, UK","start_date":"June 2025","end_date":"October 2025","description":["Modelled wave propagation using finite-difference methods in 100+ aeroacoustics simulations, assessing numerical stability and accuracy.","Analysed performance of 10 maximal-order and dispersion-relation-preserving schemes in MATLAB, optimising for accuracy versus computational cost.","Prepared concise technical outputs including a poster presented at a departmental event, and documented methods and results for peer review."]},{"title":"Project Manager","company":"Warwick Aerospace Society","location":"Coventry, UK","start_date":"January 2024","end_date":"March 2025","description":["Managed a 12-member team to design and deliver a proof-of-concept UHF satellite ground station, coordinating design, procurement and assembly within 10 weeks.","Produced 30+ pages of design documentation including bill of materials and Pugh matrices; maintained version control via GitHub to support reproducible builds.","Initiated MATLAB/Simulink modelling for rotator control and half-duplex communications, and reported weekly progress to senior leadership."]},{"title":"Fly Your Satellite Workshop (Participant)","company":"European Space Agency","location":"Noordwijk, Netherlands","start_date":"November 2024","end_date":"November 2024","description":["Completed a 5-day systems-engineering workshop covering requirements, testing and ground-station communications for CubeSats.","Participated in a time-limited CubeSat design sprint, delivering a mission-compliant concept through rapid delegation and systems-level trade-offs.","Gained practical insight into ground-station rotator control and half-duplex UHF communications relevant to RF system design and test."]},{"title":"RF Seekers Summer Intern","company":"MBDA UK","location":"Stevenage, UK","start_date":"June 2024","end_date":"August 2024","description":["Worked within the Modelling and Algorithms team on SAR processing chains for AESA radar systems; researched RF and microwave concepts to inform implementations.","Optimised a matched-filter algorithm in MATLAB using FFTs, reducing runtime by 85% and improving test and analysis throughput.","Co-developed a data-analysis application used by six colleagues to accelerate range–Doppler imagery analysis; integrated a mid-fidelity algorithm for rapid sanity checks.","Used professional development practices including version control (50+ commits) and delivered a placement review presentation to 20+ colleagues."]}],"projects":[{"title":"AI CV Generator","start_date":"July 2025","end_date":"ongoing","description":["Developed a CV and cover-letter generator using OpenAI's API in Python with Pydantic to enforce structured JSON output and docxtpl for Word generation.","Implemented SQL databases to track applications and outcomes and designed the tool to produce ATS-friendly outputs.","Validated outputs against ATS-checker tools and iterated to improve match rates; supported job-application tracking across multiple roles."]}],"skills":{"languages":["Python","MATLAB","C","SQL","JSON","HTML/CSS/JavaScript"],"libraries":["NumPy","SciPy","Matplotlib","pydantic"],"tools":["LabVIEW","Simulink","Git / GitHub","Microsoft Office (Word, Excel, PowerPoint)"],"soft_skills":["Problem solving and analytical thinking","Technical documentation and report writing","Verbal presentation and cross-functional communication","Team leadership, mentoring and training","Time management and meeting project deadlines"],"interests":["RF and microwave systems","Amateur radio","Professional development (Chartered Engineer route)"]}}