{"job_title":"Graduate Engineer","company_name":"Teledyne Microwave UK (Teledyne Technologies Incorporated / Teledyne Aerospace & Defence Electronics UK)","industry":"Aerospace & Defence / RF & Microwave / Electronics","location":"Shipley, West Yorkshire, UK","essential_requirements":["Degree or MSc in Electrical & Electronic Engineering, Communication Systems Engineering, RF Engineering, Systems Engineering (or closely related engineering discipline)","Understanding of electronic design and manufacturing processes","Affinity and enthusiasm for science, engineering and problem-solving","Eligible to gain UK Security Clearance","Ability to produce and maintain high-standard product documentation and design logbooks","Ability to communicate verbally and via presentations to peers, managers and junior staff","Willingness to provide production support, fault-finding and training to technicians","Ability to plan and coordinate own activities and meet project timescales"],"preferred_requirements":["Covered modules or coursework in RF Engineering (helpful but not essential)","Previous exposure to RF/microwave concepts or lab work","Interest in and commitment to professional development (e.g., route to Chartered Engineer)","Experience or exposure to transferring products from engineering to production or supporting manufacturing","Demonstrable experience preparing technical reports and participating in design reviews"],"hard_skills":["Electronic circuit design (analogue/digital) and RF circuit design fundamentals","Technical documentation and design logbook maintenance","Production transfer/process support and production documentation","Fault diagnosis and test/troubleshooting","Preparing technical reports and progress reports","Presenting technical designs and participating in design/project reviews","Familiarity with manufacturing processes and quality/product transfer"],"soft_skills":["Problem solving and analytical thinking","Clear verbal and written communication","Teamwork and cross-functional collaboration","Time management and meeting project deadlines","Ability to train and mentor technicians","Customer and supplier relationship management","Attention to detail and commitment to documentation","Continuous improvement mindset"],"ATS_keywords":["Graduate Engineer","Teledyne","RF","microwave","electronic design","circuit design","production support","fault finding","technical report","design review","design documentation","manufacturing processes","Electrical Engineering","Communication Systems Engineering","Systems Engineering","UK Security Clearance","Chartered Engineer","transfer to production","test technician","Shipley","West Yorkshire","RF training"],"key_responsibilities":["Design and document electronic and RF circuits as part of a cross-functional engineering team, including preparation for and participation in design reviews.","Support product transfer from engineering to production: prepare production documentation, provide production support and fault-finding, and train test/production technicians.","Compile and present regular technical and progress reports, communicate status in meetings (including daily stand-ups), and liaise with customers, suppliers and internal departments."],"tools_and_technologies":["RF & microwave technologies and components","Electronic design and documentation tools (EDA/CAD implied)","Production test equipment and test rigs (assembly/test support)","Lab instrumentation for RF/electronics testing (implied: spectrum/network analyzers, oscilloscopes)","Technical reporting and presentation tools (e.g., MS Office/PowerPoint)","Design review and product transfer documentation systems / manufacturing documentation"],"company_values":["Equality, Diversity & Inclusion","Occupational health and safety","Environmental sustainability","Honesty, integrity and high ethical standards","Customer focus – enabling safety, security and connectivity","Continuous improvement and innovation"],"tailoring_recommendations":["Lead with your degree/MSc and list relevant modules (especially RF, communications, electronic design).","Highlight any RF/microwave coursework, lab projects or final-year project; describe hands-on testing, measurement or fault-finding experience.","Show clear examples of documentation you produced (design notes, logbooks, technical reports) and participation in design reviews or project meetings.","Emphasise production/transfer experience or familiarity with manufacturing processes and production support activities.","State eligibility for UK Security Clearance (or ability to obtain) prominently.","Use ATS keywords from the job (e.g., RF, microwave, circuit design, production support, design review, UK Security Clearance).","Quantify achievements where possible (reduced test time, improved yield, project delivery timescales met).","Demonstrate soft skills: teamwork, communication (presentations), training experience and continuous improvement contributions.","Note availability to start around August/September 2025 and include location or willingness to relocate/commute to Shipley, West Yorkshire.","Mention interest in professional development (Chartered Engineer route) and willingness to undertake company RF training."]}