{"profile":"MPhys Physics (expected First) seeking Graduate Software Engineer 2025 role at SS&C. Analytical, coding and problem-solving experience in Python and MATLAB, with Git-based version control, exposure to Agile practices, testing and CI/CD concepts, and a strong interest in financial services and regulatory compliance.","education":[{"degree":"MPhys Physics","institution":"University of Warwick","location":"UK","start_date":"October 2022","end_date":"July 2026","grade":"First (expected)","description":["Relevant modules: scientific and high-performance computing, advanced mathematical methods, numerical methods and simulation.","Investigated nucleation metastability in the 2D Ising model using dozens of Monte Carlo simulations in MATLAB; co-authored a short paper within three weeks.","Numerically solved partial differential equations in C via finite-difference methods to model industrial heat flow (95%).","Developed N-body integrator in Python running 10,000+ simulations and performed advanced stability analysis (MEGNO) and post-processing.","Co-developed PID stabilisation algorithm in LabVIEW for a nodding-donkey system; implemented control logic and extended functionality (86%)."]},{"degree":"A-levels","institution":"Forest School","location":"UK","start_date":"September 2020","end_date":"July 2022","grade":"A*A*A*A*A* (Maths, Further Maths, Physics, Chemistry, Extended Project)","description":["Sixth-form valedictorian for top academic performance.","Completed a 5000-word extended project on mitigation of climate change (100%), demonstrating research, analysis and reporting skills.","Presented research to 160+ students and staff, receiving strong feedback and demonstrating clear communication."]}],"work_experience":[{"title":"Undergraduate Researcher","company":"Warwick Mathematics Institute","location":"Coventry, UK","start_date":"June 2025","end_date":"October 2025","description":["Modelled finite-difference schemes for wave propagation across 100+ aeroacoustics simulations in MATLAB, analysing accuracy versus computational cost.","Benchmarked and analysed performance of 10 high-order numerical schemes, optimising selection for accuracy and efficiency.","Documented code and results to ensure reproducibility and presented outcomes via a departmental poster."]},{"title":"Project Manager","company":"Warwick Aerospace Society","location":"Coventry, UK","start_date":"January 2024","end_date":"March 2025","description":["Led a 12-member team to design and build a proof-of-concept UHF satellite ground station; coordinated four sub-teams and weekly meetings to deliver within 10 weeks.","Introduced GitHub-based version control for model development, authored 30+ pages of technical documentation and produced a detailed bill of materials.","Implemented MATLAB/Simulink modelling for rotator control and led integration testing and debugging during the build phase.","Reported progress to senior leadership and ensured project milestones and quality standards were met."]},{"title":"RF Seekers Summer Intern","company":"MBDA UK","location":"Stevenage, UK","start_date":"June 2024","end_date":"August 2024","description":["10-week placement in the Modelling and Algorithms team working on SAR imagery processing within AESA radar systems.","Optimised a matched-filter algorithm in MATLAB using FFT, reducing runtime by 85% and materially improving system performance.","Co-developed a data-analysis application used by six colleagues to rapidly analyse range–Doppler images and integrated a mid-fidelity algorithm for quick sanity checks.","Delivered 50+ commits using professional version control practices and presented technical outcomes to 20+ colleagues."]}],"projects":[{"title":"AI CV Generator","start_date":"July 2025","end_date":"ongoing","description":["Built a CV and cover-letter generator using OpenAI's API in Python; used Pydantic for structured JSON output and docxtpl to produce Word documents.","Implemented SQL databases to track applications and progress; achieved scores above 50% on three ATS-checker sites and resulted in two job offers from 200 applications.","Applied iterative testing, input validation and Git-based version control to improve reliability and reproducibility."]},{"title":"Drinks Ordering Web App","start_date":"August 2018","end_date":"September 2018","description":["Developed a web app to process party drink orders, handling 80+ orders over six hours and removing queues using Ajax for asynchronous updates.","Implemented backend order processing and status updates and iterated the UI following user feedback.","Received positive feedback from two software engineers and all bar staff for reliability and usability."]}],"skills":{"languages":["Python","MATLAB","C","SQL","JavaScript","HTML","CSS","JSON","Willingness to learn C# / .NET"],"libraries":["NumPy","SciPy","Matplotlib","pydantic","openAI","Simulink"],"tools":["Git","GitHub","LabVIEW","Visualisation and analysis (Origin Pro)","Version control","Familiarity with unit/integration testing concepts and CI/CD workflows","Exposure to Agile/Scrum practices and issue tracking"],"soft_skills":["Analytical thinking and problem-solving","Teamwork and collaboration","Clear written and verbal communication","Proactivity and adaptability","Attention to detail and quality focus"],"interests":["Machine learning","Amateur radio","Tennis","Chess","Debating"]}}