{"opening_paragraph":"I am writing to apply for the Air Quality Field Team Analyst 2025 role at Ricardo. Your mission to create a safe and sustainable world resonates with my academic training and practical experience: as an MPhys physics student at the University of Warwick I have combined rigorous data analysis with hands‑on instrumentation and systems assembly, which I am keen to put to work on field-based air quality monitoring and reporting.","core_paragraphs":"My technical background maps directly to the key responsibilities of this role. I have designed, built and calibrated laboratory hardware (a DC voltage regulator and a stabilisation system for a nodding‑donkey) and implemented PID control in LabVIEW — experience that underpins the disciplined approach needed for on‑site testing, calibration and equipment documentation. At MBDA I developed and optimised signal‑processing and analysis tools in MATLAB, delivered over 50 commits to production code, and co‑built a data analysis application used by colleagues during field campaigns; these projects sharpened my data‑processing workflow, version control practice and ability to deliver accurate outputs under time pressure.\nI am comfortable preparing results for publication and for non‑specialist audiences: I have produced a research poster, co‑authored a short paper from simulation work, and presented placement outcomes to technical teams. My numerical work (10,000+ N‑body simulations; finite‑difference modelling of heat flow and aeroacoustics schemes) demonstrates the accuracy and attention to detail you require for data ratification and compliance. I have experience working to laboratory safety procedures and systems engineering practices from both university projects and the ESA workshop, and I am used to the physical demands of assembling and testing hardware on site. While my CV does not yet list a driving licence, I am prepared to obtain any necessary vehicle training and licences and am available for the travel and overnight stays this field role requires.","closing_paragraph":"I am motivated to bring my combination of instrumentation, data‑analysis and practical problem‑solving skills to Ricardo’s air quality team and to help ensure reliable, compliant monitoring across the UK. Thank you for considering my application — I would welcome the opportunity to discuss how my experience can support your monitoring and reporting work, and to explain how I will quickly meet any operational or vehicle‑training requirements."}