{
  "title": "Air Quality Field Team Analyst 2025",
  "company": "Ricardo",
  "deadline": "16/09/2025",
  "description": "Our vision is to create a safe and sustainable world.\nRicardo plc is a global strategic, environmental, and engineering consulting company. With over 100 years of engineering excellence and employing close to 3,000 employees in more than 20 countries, we provide exceptional levels of expertise in delivering leading-edge and innovative cross-sector sustainable products and solutions.\nEvery day, we enable our customers to solve the most complex and dynamic challenges to help achieve a safe and sustainable world.\nKey responsibilities\nAs a field-based Analyst Consultant, you will be responsible for ensuring that the monitoring equipment for air pollutants across the UK is providing the correct results and giving reliable measurements of air quality for our customers. This involves the on-site testing and calibration of equipment and subsequent data recording and processing, conducted to strict quality requirements\nYou will also be required to review and ratify air pollution measurements using our in-house software systems and strict methods prescribed by UK Law and European Directives. It would be an advantage to have an initial understanding of current air pollution problems and legislation aimed to address these issues, although comprehensive training is provided.\nThe work will require significant travel, including several weeks per quarter of extended trips away from the office and up to 4 overnight stays per week\nThe testing, calibration and documentation of air quality measuring instrumentation across Scotland and wider UK.\nData processing and reporting.\nRatification of data for publication on the Defra UK Air Quality website and the Air Quality in Scotland website \nKey competencies and experience\nA degree in Physical Sciences or Engineering is an advantage, but not essential; candidates who can demonstrate relevant experience will also be considered.\nFull, clean UK driving licence with solid driving experience - able to drive a company van.\nGood level of physical fitness in order to be able to load and unload monitoring and testing equipment.\nAwareness of site safety issues.\nThe ability to conduct research, gather and analyse data accurately and methodically\nIT literacy.\nAccuracy and attention to detail.\nStrong communication and team working skills.\nExcellent organisational and time management skills.\nSelf-reliance and good problem solving skills.\nWorking here\nYou will be warmly welcomed into our workplace where every voice matters. We are diverse thinkers and doers, coming together to create a culture of inclusion. We will support you to find your place.\nWe will encourage you to use your passion and expertise to make a positive impact through the projects you work on. Your knowledge and desire to bring about change will be invaluable in helping deliver innovative solutions that support communities across the globe in becoming safer and more sustainable.\nWork life balance\nWe offer flexible approaches to work, whether that is working from home, being in the office, or as a hybrid worker. We're happy to discuss flexible working arrangements. Wellbeing is at the core to our culture, allowing employees to flourish and to achieve their full potential.\nBenefits\nWe want you to know how much you are valued. Your remuneration and benefits package will reflect that. You will receive a range of benefits which include support for your physical and mental health.\nOur core benefits include 25 days' annual leave, plus 8 flexible bank holidays, a competitive company pension scheme, life assurance and professional subscriptions reimbursement. We also offer a wide range of flexible benefits to suit your lifestyle.\nDiversity, equality, and inclusion statement\nWe are an Equal Opportunity Employer, we believe in each person's potential, and we'll help you reach yours. We have an ambitious diversity, equality, and inclusion approach as explained here. We value diversity; recognising that a more diverse workforce creates a richer and more varied working environment.\nDiversity also drives innovation, by allowing us to offer our clients the best consultancy service that we can. As part of our commitment to engage positively and pro-actively with all our employees and to ensure an inclusive culture, we are a recognised as a 'disability confident' employer.\nNext steps\nOnce you have submitted your application a member of our Recruitment Team will be in touch. Please be aware that the timing can vary dependent on the volume of applications that we receive for each role and in some cases, we may start to review applications prior to the closing date.\nRicardo is a Disability confident employer please advise the recruitment team if you require any adjustments to support you throughout the recruitment process.",
  "essential_requirements": [
    "Field-based role performing on-site testing, calibration and documentation of air quality monitoring instrumentation across Scotland and the wider UK",
    "Ability to review and ratify air pollution measurements using in-house software and methods compliant with UK Law and European Directives",
    "Data processing and reporting of monitoring results, including preparation for publication on Defra UK Air Quality and Air Quality in Scotland websites",
    "Significant travel required (several weeks per quarter away from the office) and up to 4 overnight stays per week",
    "Full, clean UK driving licence with experience driving a company van",
    "Good physical fitness to load/unload monitoring and testing equipment",
    "Awareness of site safety issues and ability to work safely on customer sites",
    "Ability to conduct research, gather and analyse data accurately and methodically",
    "IT literacy (ability to use in-house software, laptops/tablets and standard office software)",
    "High accuracy and attention to detail",
    "Strong communication and teamworking skills",
    "Excellent organisational and time-management skills",
    "Self-reliance and proven problem-solving skills"
  ],
  "preferred_requirements": [
    "Degree in Physical Sciences or Engineering (advantage but not essential)",
    "Initial understanding of current air pollution issues and relevant UK/EU legislation (advantage)",
    "Prior experience with air quality monitoring instrumentation, calibration and site commissioning",
    "Experience with data ratification/publication workflows for governmental air quality platforms"
  ],
  "hard_skills": [
    "On-site testing and calibration of air quality monitoring equipment",
    "Instrumentation documentation and maintenance",
    "Environmental data processing, analysis and reporting",
    "Data ratification to regulatory standards (UK Law / European Directives)",
    "Use of in-house monitoring software and data management systems",
    "Competent driving of a company van and managing logistics for fieldwork",
    "Basic IT skills (MS Office / Excel, laptops/tablets, data upload/download)"
  ],
  "soft_skills": [
    "Attention to detail and accuracy",
    "Strong verbal and written communication",
    "Teamworking and collaboration",
    "Organisation and time management",
    "Self-motivated and able to work independently",
    "Practical problem solving",
    "Physical resilience and adaptability",
    "Flexibility to travel and work away from home"
  ],
  "ATS_keywords": [
    "Analyst Consultant",
    "field-based",
    "air quality",
    "air pollutants",
    "monitoring equipment",
    "testing",
    "calibration",
    "data processing",
    "data ratification",
    "Defra UK Air Quality",
    "Air Quality in Scotland",
    "UK Law",
    "European Directives",
    "environmental consulting",
    "sustainability",
    "in-house software",
    "driving licence",
    "company van",
    "site safety",
    "IT literacy",
    "data analysis",
    "reporting",
    "instrumentation",
    "documentation"
  ],
  "key_responsibilities": [
    "Carry out on-site testing, calibration, maintenance and documentation of air quality monitoring instruments across Scotland and the wider UK to ensure accurate and reliable measurements.",
    "Process, analyse and ratify air pollution measurement data using in-house software and prescribed methods to prepare results for publication on the Defra UK Air Quality and Air Quality in Scotland websites.",
    "Ensure compliance with quality assurance procedures, UK Law and European Directives, manage field logistics (travel, equipment handling) and maintain site safety standards."
  ],
  "tools_and_technologies": [
    "Air quality monitoring instruments (gas analysers, particulate/PM monitors, meteorological sensors)",
    "Calibration equipment (zero/span calibrators, calibration gas cylinders)",
    "In-house data management and ratification software",
    "Data logging hardware and telemetry systems",
    "Laptops / tablets and MS Office (Excel) for data processing and reporting",
    "Company van / field vehicle and standard field PPE",
    "Web publication platforms (Defra UK Air Quality website, Air Quality in Scotland website)"
  ],
  "company_values": [
    "Creating a safe and sustainable world",
    "Engineering excellence and innovation",
    "Diversity, equality and inclusion",
    "Supportive and inclusive workplace where every voice matters",
    "Wellbeing and work–life balance",
    "Flexibility in working arrangements",
    "Commitment to professional development and positive community impact",
    "Disability confident employer"
  ],
  "tailoring_recommendations": [
    "Lead with field-relevant experience on the CV: highlight specific examples of on-site testing, calibration and maintenance of air quality or similar environmental monitoring instrumentation.",
    "Quantify outcomes where possible (e.g., number of sites maintained, volume of data processed, reduction in downtime, compliance record) to show impact and reliability.",
    "Explicitly state a full, clean UK driving licence and experience driving vans; note willingness to travel and availability for extended trips and overnight stays.",
    "Call out experience with data processing, ratification and publication workflows; name relevant software/tools (e.g., Excel, data logging systems, any in‑house or SCADA/telemetry tools) and familiarity with Defra/SAS publication if applicable.",
    "If you have a degree in Physical Sciences or Engineering, place it prominently; if not, emphasise demonstrable hands-on experience and relevant training.",
    "Demonstrate understanding of or training in UK/EU air quality legislation, quality assurance and health & safety/site safety practices.",
    "Highlight soft skills sought by the employer: attention to detail, organisation, communication, teamwork and problem solving with brief evidence/examples.",
    "Include any professional certifications or training (e.g., instrument-specific training, health & safety, driving/vehicle certifications) and be ready to provide referees who can confirm field and compliance experience."
  ]
}