{
  "title": "Graduate Software Engineer 2025",
  "company": "SS&C",
  "deadline": "22/08/2025",
  "description": "As a leading financial services and healthcare technology company based on revenue, SS&C is headquartered in Windsor, Connecticut, and has 27,000+ employees in 35 countries.\nSome 20,000 financial services and healthcare organizations, from the world's largest companies to small and mid-market firms, rely on SS&C for expertise, scale, and technology.\nRole summary\nOpportunity to contribute to key areas of a leading financial services organisation, across technology and operational functions. Graduates will develop essential workplace skills, gain exposure to real-world projects, and take part in structured learning to support long-term career development.\nKey responsibilities\nSoftware Development\nWriting, testing, and debugging code in languages like .net.\nImplementing features based on requirements and design specifications.\nFollowing best coding practices and industry standards.\nLearning & Development\nGaining proficiency in relevant technologies, frameworks, and tools.\nParticipating in code reviews and feedback sessions.\nUnderstanding software development methodologies like Agile and Scrum.\nCollaboration & Communication\nWorking closely with senior developers, product managers, designers and business analysts.\nAttending team meetings and stand-ups to discuss progress.\nDocumenting code, processes, and technical findings.\nTesting & Debugging\nWriting unit and integration tests to ensure code reliability.\nDebugging and troubleshooting software issues.\nAssisting in quality assurance (QA) processes.\nVersion Control & Deployment\nUsing Git/TFS for version control.\nAssisting in Continuous Integration/Continuous Deployment (CI/CD) pipelines.\nLearning about cloud services and deployment strategies.\nProblem-Solving & Innovation\nResearching and implementing new technologies.\nIdentifying and suggesting improvements to existing codebases.\nContributing to brainstorming and problem-solving sessions.\nLearning & development\nCompletion of core learning modules, including financial services regulation, professional behaviours, and internal systems/processes.\nActive participation in technical or operational training aligned with your role (e.g., coding, data analysis, process improvement, systems training).\nRegular reviews with line managers and mentors to support continuous development.\nEncouraged to work towards relevant professional qualifications (where applicable).\nTo carry out any other duties which are within the employee's skills and abilities whenever reasonably instructed\nTechnical requirements and qualifications\nRecent graduate (or final-year student) with a degree in any discipline – STEM or business-related fields preferred for certain role.  To be expecting or have achieved a 2.2 degree classification or above. \nA strong interest in financial services and a desire to develop a career in technology, customer services or operations.\nAnalytical and problem-solving mindset, with attention to detail.\nProactive attitude with strong communication and teamwork skills.\nAbility to learn new systems and concepts quickly.\nDemonstrated adaptability and willingness to take on new challenges.\nCore requirements\nRegulatory\nSS&C Employees are required to comply with the regulatory regime in which SS&C operates as appropriate to the above role.\nEmployees are expected to exercise due care and diligence, ensuring the areas the incumbent is responsible for are organised and controlled.\nEmployees are required to observe proper standards of market, business and personal conduct, demonstrating integrity in the execution of duties.\nThe incumbent is required to respect the SS&C approach to client care and must demonstrate due regard to the interests of our clients and in any and all third-party dealings.\nTo exercise due care and diligence, ensuring the areas the role is responsible for are organised and controlled.\nTo uphold responsibilities for risk and business continuity practices as appropriate to the position the role holds within the organisation.\nTo comply with the regulatory regimes in which SS&C operates, with consideration given to relevant Client Asset, Data Protection and Financial Crime Prevention regulations, as appropriate to the above role.\nQuality\nAll employees are accountable for the delivery of a Quality service, driving for excellence in all their work activities:\nTo be quality driven, aiming for 100% accuracy and timeliness of delivery\nTo effectively plan the way services are delivered so that all activity is directly related to providing quality services and meeting the expectations of the customer (internal and external)\nTo continuously review processes and practices relating to the role and act as a catalyst for change and improvement in individual and team performance\nTo observe proper standards of market, business and personal conduct, demonstrating integrity in the execution of duties\nTo communicate and promote the values which reinforce and support a consistent quality culture\nTo ensure that monthly KPI’s are met and adhered to.\nUnless explicitly requested or approached by SS&C Technologies, Inc. or any of its affiliated companies, the company will not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services.\nSS&C Technologies is an Equal Employment Opportunity employer and does not discriminate against any applicant for employment or employee on the basis of race, color, religious creed, gender, age, marital status, sexual orientation, national origin, disability, veteran status or any other classification protected by applicable discrimination laws.",
  "essential_requirements": [
    "Recent graduate or final-year student (degree in any discipline; STEM or business preferred for some roles)",
    "Degree classification of 2.2 or above (or expecting to achieve this)",
    "Strong interest in financial services and desire to build a career in technology, customer services or operations",
    "Analytical and problem-solving mindset with strong attention to detail",
    "Proactive attitude, adaptability and willingness to take on new challenges",
    "Good verbal and written communication skills and ability to work well in a team",
    "Ability to learn new systems and concepts quickly",
    "Willingness to participate in structured learning, code reviews and mentoring",
    "Commitment to regulatory compliance, integrity and due care/diligence in work",
    "Quality-driven with focus on accuracy, timeliness and meeting KPIs"
  ],
  "preferred_requirements": [
    "Prior experience or academic exposure to software development (preferably .NET)",
    "Familiarity with version control systems (Git, TFS)",
    "Basic understanding of testing practices (unit and integration tests) and QA processes",
    "Awareness of Agile/Scrum methodologies",
    "Exposure to CI/CD pipelines and cloud services (AWS/Azure/GCP)",
    "Interest or progress toward relevant professional qualifications (where applicable)",
    "Previous internship or project experience in financial services, technology or operations"
  ],
  "hard_skills": [
    ".NET development (writing, testing and debugging code)",
    "Unit and integration testing",
    "Version control (Git, TFS)",
    "Working with CI/CD pipelines and deployment processes",
    "Basic cloud services knowledge (deployment strategies)",
    "Debugging and troubleshooting software issues",
    "Documentation of code and technical processes",
    "Familiarity with software development methodologies (Agile/Scrum)",
    "Data analysis and process improvement (basic level)"
  ],
  "soft_skills": [
    "Communication (clarity in meetings, documentation and stakeholder interactions)",
    "Teamwork and collaboration with developers, product managers and analysts",
    "Analytical thinking and problem solving",
    "Adaptability and openness to feedback",
    "Proactivity and self-directed learning",
    "Attention to detail and quality orientation",
    "Integrity and professionalism",
    "Time management and prioritisation"
  ],
  "ATS_keywords": [
    "Graduate",
    ".NET",
    "Software Development",
    "Git",
    "TFS",
    "CI/CD",
    "Unit testing",
    "Integration testing",
    "Debugging",
    "Agile",
    "Scrum",
    "Cloud services",
    "Quality Assurance",
    "Code review",
    "Financial services",
    "Regulatory compliance",
    "Continuous Improvement",
    "KPI",
    "Documentation",
    "Professional qualifications"
  ],
  "key_responsibilities": [
    "Develop, test and maintain software (writing, testing and debugging code — .NET stack indicated) and implement features from requirements/designs using best coding practices.",
    "Participate in testing and QA activities (write unit/integration tests, troubleshoot defects) and assist with version control and CI/CD/deployment activities.",
    "Collaborate with cross-functional teams (senior developers, product managers, designers, business analysts), attend stand-ups and code reviews, document technical work and engage in continuous learning/mentoring."
  ],
  "tools_and_technologies": [
    ".NET (development framework)",
    "Version control systems: Git, TFS",
    "CI/CD tooling and pipelines (e.g., Azure DevOps/Jenkins/GitHub Actions — role references CI/CD generally)",
    "Cloud services (AWS, Azure or GCP — learning about cloud and deployment strategies)",
    "Unit/integration testing frameworks (e.g., NUnit, xUnit — testing referenced)",
    "Agile/Scrum collaboration tools (e.g., Jira, Confluence — implied by Agile/Scrum and team collaboration)"
  ],
  "company_values": [
    "Quality-driven delivery (accuracy, timeliness and continuous improvement)",
    "Integrity and professional conduct",
    "Client care and respect for client interests",
    "Regulatory compliance and risk management",
    "Collaboration and mentorship",
    "Equal opportunity and diversity",
    "Learning and career development"
  ],
  "tailoring_recommendations": [
    "Lead with academic details: degree subject and classification (2.2 or above) and any coursework relevant to software/finance.",
    "Highlight any .NET or general software projects (GitHub links, short descriptions, technologies used, your contributions and outcomes).",
    "Show hands-on experience with version control (Git/TFS), testing (unit/integration) and any exposure to CI/CD or cloud services — even course/project experience counts.",
    "Use ATS keywords from the job description (e.g., .NET, Git, CI/CD, unit testing, Agile, financial services, regulatory) in your CV skill and experience sections.",
    "Quantify achievements where possible (e.g., reduced bug rate, delivered X features, improved test coverage by Y%).",
    "Demonstrate soft skills with concise examples: teamwork (group project), communication (presentations), adaptability (learning a new technology quickly).",
    "Mention any relevant internships, extra-curricular technical activities, or certifications and willingness to pursue professional qualifications.",
    "Include evidence of quality focus and compliance awareness (examples of following standards, attention to detail or meeting KPIs).",
    "Keep a short tailored summary at top of CV stating interest in financial services technology, eagerness to learn, and alignment with SS&C values."
  ]
}