{"job_title":"M&A Analyst","company_name":"Not specified","industry":"Banking and Financial Advisory","location":"Not specified","essential_requirements":["1–2 years of relevant work experience in M&A, investment banking, corporate finance or similar","Solid understanding of M&A transaction processes","Suitable academic qualifications (finance, accounting, economics or related degree)","Strong financial and mathematical skills (financial modelling, valuation)","Ability to prepare financial models and conduct quantitative analyses","Experience supporting client due diligence","Ability to draft Confidential Information Memoranda (CIMs) and create client presentations","Sound organisational skills and time management","Track record of delivering results and meeting tight, demanding deadlines","Excellent written and verbal communication skills","Client-focused / professional demeanour for representing businesses in critical moments"],"preferred_requirements":["Desire for career progression in banking and financial advisory","Experience researching industry trends and prospective acquirers","Exposure to end-to-end deal processes (from marketing materials to close)","Prior experience with preparing client-facing materials"],"hard_skills":["Financial modelling (DCF, LBO, comparable analysis, merger models)","Valuation techniques","Due diligence support and documentation","Preparing CIMs and deal / pitch materials","Financial statement analysis","Quantitative analysis and forecasting","Creating client presentations (PowerPoint)","Industry/market research and competitor / acquirer analysis","Advanced Excel skills (formulas, pivot tables, scenario analysis)"],"soft_skills":["Results-driven / high-performance orientation","Strong communication (written and verbal)","Organisational skills and prioritisation","Ability to work under pressure and meet tight deadlines","Attention to detail","Teamwork / collaboration","Client service mindset","Adaptability and willingness to learn"],"ATS_keywords":["M&A","Mergers & Acquisitions","Financial modelling","Valuation","Due diligence","CIM","Confidential Information Memorandum","Client presentations","Pitchbook","Industry research","Prospective acquirers","Transactions","Investment banking","Banking","Financial advisory","Excel","PowerPoint","Financial analysis","Deal execution","Analyst"],"key_responsibilities":["Prepare and maintain financial models and valuation analyses to support M&A transaction structuring and recommendations.","Support client due diligence and draft transaction documentation including Confidential Information Memoranda (CIMs) and other marketing materials.","Create client presentations, conduct industry and acquirer research, and perform analyses of prospective buyers to inform transaction strategy."],"tools_and_technologies":["Microsoft Excel (advanced)","Microsoft PowerPoint","Financial databases / research platforms (e.g., S&P Capital IQ, Bloomberg, PitchBook, FactSet) — commonly used for industry and comparable analysis","Document preparation and collaboration tools (Word, Google Docs, SharePoint/Teams)"],"company_values":["Client focus — representing businesses during critical moments","Results-driven and performance-oriented","Hard-working and focused team culture","Career progression and professional development","High standards of professionalism and reliability"],"tailoring_recommendations":["Lead your CV with an M&A-focused summary that states 1–2 years of relevant deal experience and interest in banking/financial advisory career progression.","Quantify deal experience: number of transactions supported, deal sizes, responsibilities on each deal (e.g., model prepared, CIM drafted).","Emphasise hard skills: list specific financial models built, valuation techniques used, and Excel functions/macros you know.","Include examples of CIMs, pitchbooks or client presentations you contributed to (describe your exact role).","Highlight due diligence work and research projects (industry analyses, buyer lists, comparable company work).","Demonstrate soft skills with brief examples: meeting tight deadlines, teamwork on deals, client interactions or stakeholder management.","Mirror ATS keywords from the job description in your CV (M&A, financial modelling, CIM, due diligence, client presentations, valuation, Excel, PowerPoint).","Ensure academic qualifications are clearly listed (degree, major, relevant coursework) and any relevant certifications.","Keep the CV concise, results-focused and tailored to transaction-oriented responsibilities rather than general finance duties."]}